[{"Id":3,"Name":"Agile Maneuvers","Description":"You've learned to use your quickness in place of brute force when performing combat maneuvers.","Benefit":"You add your Dexterity bonus to your base attack bonus and size bonus when determining your Combat Maneuver Bonus (see Chapter 8) instead of your Strength bonus.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":7,"Name":"Arcane Armor Mastery","Description":"You have mastered the ability to cast spells while wearing armor.","Benefit":"As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 20% for any spells you cast this round. This bonus replaces, and does not stack with, the bonus granted by Arcane Armor Training.","FeatType":1,"Requirements":[{"RequirementType":8,"Value":7},{"RequirementType":6,"Value":8},{"RequirementType":6,"Value":12}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":8,"Name":"Arcane Armor Training","Description":"You have learned how to cast spells while wearing armor.","Benefit":"As a swift action, reduce the arcane spell failure chance due to the armor you are wearing by 10% for any spells you cast this round.","FeatType":1,"Requirements":[{"RequirementType":8,"Value":3},{"RequirementType":6,"Value":11}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":10,"Name":"Heavy Armor Proficiency","Description":"You are skilled at wearing heavy armor.","Benefit":"See Armor Proficiency, Light.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":11},{"RequirementType":6,"Value":12}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":11,"Name":"Light Armor Proficiency","Description":"You are skilled at wearing light armor.","Benefit":"When you wear a type of armor with which you are proficient, the armor check penalty for that armor applies only to Dexterity- and Strength-based skill checks.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":12,"Name":"Medium Armor Proficiency","Description":"You are skilled at wearing medium armor.","Benefit":"See Armor Proficiency, Light.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":11}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":15,"Name":"Bleeding Critical","Description":"Your critical hits cause opponents to bleed profusely.","Benefit":"Whenever you score a critical hit with a slashing or piercing weapon, your opponent takes 2d6 points of bleed damage (see Appendix 2) each round on his turn, in addition to the damage dealt by the critical hit. Bleed damage can be stopped by a DC 15 Heal skill check or through any magical healing. The effects of this feat stack.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":16,"Name":"Blind-Fight","Description":"You are skilled at attacking opponents that you cannot clearly perceive.","Benefit":"In melee, every time you miss because of concealment (see Chapter 8), you can reroll your miss chance percentile roll one time to see if you actually hit. An invisible attacker gets no advantages related to hitting you in melee. That is, you don't lose your Dexterity bonus to Armor Class, and the attacker doesn't get the usual +2 bonus for being invisible. The invisible attacker's bonuses do still apply for ranged attacks, however. You do not need to make Acrobatics skill checks to move at full speed while blinded.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":17,"Name":"Blinding Critical","Description":"Your critical hits blind your opponents.","Benefit":"Whenever you score a critical hit, your opponent is permanently blinded. A successful Fortitude save reduces this to dazzled for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on creatures that do not rely on eyes for sight or creatures with more than two eyes (although multiple critical hits might cause blindness, at the GM's discretion). Blindness can be cured by heal, regeneration, remove blindness, or similar abilities.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":15},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":19,"Name":"Catch Off-Guard","Description":"Foes are surprised by your skilled use of unorthodox and improvised weapons.","Benefit":"You do not suffer any penalties for using an improvised melee weapon. Unarmed opponents are flat-footed against any attacks you make with an improvised melee weapon.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":21,"Name":"Cleave","Description":"You can strike two adjacent foes with a single swing.","Benefit":"As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the first and also within reach. You can only make one additional attack per round with this feat. When you use this feat, you take a -2 penalty to your Armor Class until your next turn.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":23,"Name":"Combat Expertise","Description":"You can increase your defense at the expense of your accuracy.","Benefit":"You can choose to take a -1 penalty on melee attack rolls and combat maneuver checks to gain a +1 dodge bonus to your Armor Class. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by -1 and the dodge bonus increases by +1. You can only choose to use this feat when you declare that you are making an attack or a full-attack action with a melee weapon. The effects of this feat last until your next turn.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":24,"Name":"Combat Reflexes","Description":"You can make additional attacks of opportunity.","Benefit":"You may make a number of additional attacks of opportunity per round equal to your Dexterity bonus. With this feat, you may also make attacks of opportunity while flat-footed.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":31,"Name":"Critical Focus","Description":"You are trained in the art of causing pain.","Benefit":"You receive a +4 circumstance bonus on attack rolls made to confirm critical hits.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":9}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":34,"Name":"Deadly Aim","Description":"You can make exceptionally deadly ranged attacks by pinpointing a foe's weak spot, at the expense of making the attack less likely to succeed.","Benefit":"You can choose to take a -1 penalty on all ranged attack rolls to gain a +2 bonus on all ranged damage rolls. When your base attack bonus reaches +4, and every +4 thereafter, the penalty increases by -1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":36,"Name":"Deafening Critical","Description":"Your critical hits cause enemies to lose their hearing.","Benefit":"Whenever you score a critical hit against an opponent, the victim is permanently deafened. A successful Fortitude save reduces the deafness to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. This feat has no effect on deaf creatures. This deafness can be cured by heal, regeneration, remove deafness, or a similar ability.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":38,"Name":"Defensive Combat Training","Description":"You excel at defending yourself from all manner of combat maneuvers.","Benefit":"You treat your total Hit Dice as your base attack bonus when calculating your Combat Maneuver Defense (see Chapter 8).","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":39,"Name":"Deflect Arrows","Description":"You can knock arrows and other projectiles off course, preventing them from hitting you.","Benefit":"You must have at least one hand free (holding nothing) to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon, you may def lect it so that you take no damage from it. You must be aware of the attack and not flat-footed. Attempting to def lect a ranged attack doesn't count as an action. Unusually massive ranged weapons (such as boulders or ballista bolts) and ranged attacks generated by natural attacks or spell effects can't be def lected.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":42,"Name":"Disruptive","Description":"Your training makes it difficult for enemy spellcasters to safely cast spells near you.","Benefit":"The DC to cast spells defensively increases by +4 for all enemies that are within your threatened area. This increase to casting spells defensively only applies if you are aware of the enemy's location and are capable of taking an attack of opportunity. If you can only take one attack of opportunity per round and have already used that attack, this increase does not apply.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":43,"Name":"Dodge","Description":"Your training and ref lexes allow you to react swiftly to avoid an opponents' attacks.","Benefit":"You gain a +1 dodge bonus to your AC. A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":44,"Name":"Double Slice","Description":"Your off-hand weapon while dual-wielding strikes with greater power.","Benefit":"Add your Strength bonus to damage rolls made with your off-hand weapon.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":50,"Name":"Exhausting Critical","Description":"Your critical hits cause opponents to become exhausted.","Benefit":"When you score a critical hit on a foe, your target immediately becomes exhausted. This feat has no effect on exhausted creatures.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":15},{"RequirementType":6,"Value":31},{"RequirementType":6,"Value":160}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":51,"Name":"Exotic Weapon Proficiency","Description":"Choose one type of exotic weapon, such as the spiked chain or whip. You understand how to use that type of exotic weapon in combat, and can utilize any special tricks or qualities that exotic weapon might allow.","Benefit":"You make attack rolls with the weapon normally.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":59,"Name":"Far Shot","Description":"You are more accurate at longer ranges.","Benefit":"You only suffer a -1 penalty per full range increment between you and your target when using a ranged weapon.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":62,"Name":"Gorgon's Fist","Description":"With one well-placed blow, you leave your target reeling.","Benefit":"As a standard action, make a single unarmed melee attack against a foe whose speed is reduced (such as from Scorpion Style). If the attack hits, you deal damage normally and the target is staggered until the end of your next turn unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier). This feat has no effect on targets that are staggered.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":131}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":63,"Name":"Great Cleave","Description":"You can strike many adjacent foes with a single blow.","Benefit":"As a standard action, you can make a single attack at your full base attack bonus against a foe within reach. If you hit, you deal damage normally and can make an additional attack (using your full base attack bonus) against a foe that is adjacent to the previous foe and also within reach. If you hit, you can continue to make attacks against foes adjacent to the previous foe, so long as they are within your reach. You cannot attack an individual foe more than once during this attack action. When you use this feat, you take a -2 penalty to your Armor Class until your next turn.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":65,"Name":"Greater Bull Rush","Description":"Your bull rush attacks throw enemies off balance.","Benefit":"You receive a +2 bonus on checks made to bull rush a foe. This bonus stacks with the bonus granted by Improved Bull Rush. Whenever you bull rush an opponent, his movement provokes attacks of opportunity from all of your allies (but not you).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":81},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":66,"Name":"Greater Disarm","Description":"You can knock weapons far from an enemy's grasp.","Benefit":"You receive a +2 bonus on checks made to disarm a foe. This bonus stacks with the bonus granted by Improved Disarm. Whenever you successfully disarm an opponent, the weapon lands 15 feet away from its previous wielder, in a random direction.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":85}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":67,"Name":"Greater Feint","Description":"You are skilled at making foes overreact to your attacks.","Benefit":"Whenever you use feint to cause an opponent to lose his Dexterity bonus, he loses that bonus until the beginning of your next turn, in addition to losing his Dexterity bonus against your next attack.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":87}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":68,"Name":"Greater Grapple","Description":"Maintaining a grapple is second nature to you.","Benefit":"You receive a +2 bonus on checks made to grapple a foe. This bonus stacks with the bonus granted by Improved Grapple. Once you have grappled a creature, maintaining the grapple is a move action. This feat allows you to make two grapple checks each round (to move, harm, or pin your opponent), but you are not required to make two checks. You only need to succeed at one of these checks to maintain the grapple.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":69,"Name":"Greater Overrun","Description":"Enemies must dive to avoid your dangerous move.","Benefit":"You receive a +2 bonus on checks made to overrun a foe. This bonus stacks with the bonus granted by Improved Overrun. Whenever you overrun opponents, they provoke attacks of opportunity if they are knocked prone by your overrun.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":93},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":70,"Name":"Greater Penetrating Strike","Description":"Your attacks penetrate the defenses of most foes.","Benefit":"Your attacks made with weapons selected with Weapon Focus ignore up to 10 points of damage reduction. This amount is reduced to 5 points for damage reduction without a type (such as DR 10/-).","FeatType":1,"Requirements":[{"RequirementType":9,"Value":16},{"RequirementType":6,"Value":119},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":71,"Name":"Greater Shield Focus","Description":"You are skilled at def lecting blows with your shield.","Benefit":"Increase the AC bonus granted by any shield you are using by 1. This bonus stacks with the bonus granted by Shield Focus.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":8},{"RequirementType":6,"Value":136},{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":74,"Name":"Greater Sunder","Description":"Your devastating strikes cleave through weapons and armor and into their wielders, damaging both item and wielder alike in a single terrific strike.","Benefit":"You receive a +2 bonus on checks made to sunder an item. This bonus stacks with the bonus granted by Improved Sunder. Whenever you sunder to destroy a weapon, shield, or suit of armor, any excess damage is applied to the item's wielder. No damage is transferred if you decide to leave the item with 1 hit point.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":96},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":75,"Name":"Greater Trip","Description":"You can make free attacks on foes that you knock down.","Benefit":"You receive a +2 bonus on checks made to trip a foe. This bonus stacks with the bonus granted by Improved Trip. Whenever you successfully trip an opponent, that opponent provokes attacks of opportunity.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":76,"Name":"Greater Two-Weapon Fighting","Description":"You are incredibly skilled at fighting with two weapons at the same time.","Benefit":"You get a third attack with your off-hand weapon, albeit at a -10 penalty.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":19},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":98},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":77,"Name":"Greater Vital Strike","Description":"You can make a single attack that deals incredible damage.","Benefit":"When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack four times and add the results together before adding bonuses from Strength, weapon abilities (such as flaming), precision-based damage (such as sneak attack), and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":16},{"RequirementType":6,"Value":100},{"RequirementType":6,"Value":169}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":81,"Name":"Improved Bull Rush","Description":"You are skilled at pushing your foes around.","Benefit":"You do not provoke an attack of opportunity when performing a bull rush combat maneuver. In addition, you receive a +2 bonus on checks made to bull rush a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to bull rush you.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":85,"Name":"Improved Disarm","Description":"You are skilled at knocking weapons from a foe's grasp.","Benefit":"You do not provoke an attack of opportunity when performing a disarm combat maneuver. In addition, you receive a +2 bonus on checks made to disarm a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to disarm you.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":87,"Name":"Improved Feint","Description":"You are skilled at fooling your opponents in combat.","Benefit":"You can make a Bluff check to feint in combat as a move action.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":88,"Name":"Improved Grapple","Description":"You are skilled at grappling opponents.","Benefit":"You do not provoke an attack of opportunity when performing a grapple combat maneuver. In addition, you receive a +2 bonus on checks made to grapple a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to grapple you.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":90,"Name":"Improved Initiative","Description":"Your quick ref lexes allow you to react rapidly to danger.","Benefit":"You get a +4 bonus on initiative checks.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":93,"Name":"Improved Overrun","Description":"You are skilled at running down your foes.","Benefit":"You do not provoke an attack of opportunity when performing an overrun combat maneuver. In addition, you receive a +2 bonus on checks made to overrrun a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to overrun you. Targets of your overrun attempt may not choose to avoid you.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":94,"Name":"Improved Precise Shot","Description":"Your ranged attacks ignore anything but total concealment and cover.","Benefit":"Your ranged attacks ignore the AC bonus granted to targets by anything less than total cover, and the miss chance granted to targets by anything less than total concealment. Total cover and total concealment provide their normal benefits against your ranged attacks.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":19},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":124}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":95,"Name":"Improved Shield Bash","Description":"You can protect yourself with your shield, even if you use it to attack.","Benefit":"When you perform a shield bash, you may still apply the shield's shield bonus to your AC.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":96,"Name":"Improved Sunder","Description":"You are skilled at damaging your foes' weapons and armor.","Benefit":"You do not provoke an attack of opportunity when performing a sunder combat maneuver. In addition, you receive a +2 bonus on checks made to sunder an item. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to sunder your gear.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":97,"Name":"Improved Trip","Description":"You are skilled at sending your opponents to the ground.","Benefit":"You do not provoke an attack of opportunity when performing a trip combat maneuver. In addition, you receive a +2 bonus on checks made to trip a foe. You also receive a +2 bonus to your Combat Maneuver Defense whenever an opponent tries to trip you.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":98,"Name":"Improved Two-Weapon Fighting","Description":"You are skilled at fighting with two weapons.","Benefit":"In addition to the standard single extra attack you get with an off-hand weapon, you get a second attack with it, albeit at a -5 penalty.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":99,"Name":"Improved Unarmed Strike","Description":"You are skilled at fighting while unarmed.","Benefit":"You are considered to be armed even when unarmed-you do not provoke attacks of opportunity when you attack foes while unarmed. Your unarmed strikes can deal lethal or nonlethal damage, at your choice.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":100,"Name":"Improved Vital Strike","Description":"You can make a single attack that deals a large amount of damage.","Benefit":"When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack three times and add the results together before adding bonuses from Strength, weapon abilities (such as flaming), precision-based damage, and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":169}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":102,"Name":"Intimidating Prowess","Description":"Your physical might is intimidating to others.","Benefit":"Add your Strength modifier to Intimidate skill checks in addition to your Charisma modifier.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":106,"Name":"Lightning Stance","Description":"The speed at which you move makes it nearly impossible for opponents to strike you.","Benefit":"If you take two actions to move or a withdraw action in a turn, you gain 50% concealment for 1 round.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":175}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":107,"Name":"Lunge","Description":"You can strike foes that would normally be out of reach.","Benefit":"You can increase the reach of your melee attacks by 5 feet until the end of your turn by taking a -2 penalty to your AC until your next turn. You must decide to use this ability before any attacks are made.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":109,"Name":"Manyshot","Description":"You can fire multiple arrows at a single target.","Benefit":"When making a full-attack action with a bow, your first attack fires two arrows. If the attack hits, both arrows hit. Apply precision-based damage (such as sneak attack) and critical hit damage only once for this attack. Damage bonuses from using a composite bow with a high Strength bonus apply to each arrow, as do other damage bonuses, such as a ranger's favored enemy bonus. Damage reduction and resistances apply separately to each arrow.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":128}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":110,"Name":"Martial Weapon Proficiency","Description":"Choose a type of martial weapon. You understand how to use that type of martial weapon in combat.","Benefit":"You make attack rolls with the selected weapon normally (without the non-proficient penalty).","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":113,"Name":"Medusa's Wrath","Description":"You can take advantage of your opponent's confusion, delivering multiple blows.","Benefit":"Whenever you use the full-attack action and make at least one unarmed strike, you can make two additional unarmed strikes at your highest base attack bonus. These bonus attacks must be made against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":62},{"RequirementType":6,"Value":131}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":114,"Name":"Mobility","Description":"You can easily move through a dangerous melee.","Benefit":"You get a +4 dodge bonus to Armor Class against attacks of opportunity caused when you move out of or within a threatened area. A condition that makes you lose your Dexterity bonus to Armor Class (if any) also makes you lose dodge bonuses. Dodge bonuses stack with each other, unlike most types of bonuses.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":43}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":121,"Name":"Pinpoint Targeting","Description":"You can target the weak points in your opponent's armor.","Benefit":"As a standard action, make a single ranged attack. The target does not gain any armor, natural armor, or shield bonuses to its Armor Class. You do not gain the benefit of this feat if you move this round.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":19},{"RequirementType":10,"Value":16},{"RequirementType":6,"Value":94},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":124}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":122,"Name":"Point-Blank Shot","Description":"You are especially accurate when making ranged attacks against close targets.","Benefit":"You get a +1 bonus on attack and damage rolls with ranged weapons at ranges of up to 30 feet.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":123,"Name":"Power Attack","Description":"You can make exceptionally deadly melee attacks by sacrificing accuracy for strength.","Benefit":"You can choose to take a -1 penalty on all melee attack rolls and combat maneuver checks to gain a +2 bonus on all melee damage rolls. This bonus to damage is increased by half (+50%) if you are making an attack with a two-handed weapon, a one handed weapon using two hands, or a primary natural weapon that adds 1-1/2 times your Strength modif ier on damage rolls. This bonus to damage is halved (-50%) if you are making an attack with an off-hand weapon or secondary natural weapon. When your base attack bonus reaches +4, and every 4 points thereafter, the penalty increases by -1 and the bonus to damage increases by +2. You must choose to use this feat before making an attack roll, and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":124,"Name":"Precise Shot","Description":"You are adept at firing ranged attacks into melee.","Benefit":"You can shoot or throw ranged weapons at an opponent engaged in melee without taking the standard -4 penalty on your attack roll.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":125,"Name":"Quick Draw","Description":"You can draw weapons faster than most.","Benefit":"You can draw a weapon as a free action instead of as a move action. You can draw a hidden weapon (see the Sleight of Hand skill) as a move action. A character who has selected this feat may throw weapons at his full normal rate of attacks (much like a character with a bow). Alchemical items, potions, scrolls, and wands cannot be drawn quickly using this feat.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":128,"Name":"Rapid Shot","Description":"You can make an additional ranged attack.","Benefit":"When making a full-attack action with a ranged weapon, you can fire one additional time this round at your highest bonus. All of your attack rolls take a -2 penalty when using Rapid Shot.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":131,"Name":"Scorpion Style","Description":"You can perform an unarmed strike that greatly hampers your target's movement.","Benefit":"To use this feat, you must make a single unarmed attack as a standard action. If this unarmed attack hits, you deal damage normally, and the target's base land speed is reduced to 5 feet for a number of rounds equal to your Wisdom modifier unless it makes a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier).","FeatType":1,"Requirements":[{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":136,"Name":"Shield Focus","Description":"You are skilled at def lecting blows with your shield.","Benefit":"Increase the AC bonus granted by any shield you are using by 1.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":137,"Name":"Shield Proficiency","Description":"You are trained in how to properly use a shield.","Benefit":"When you use a shield (except a tower shield), the shield's armor check penalty only applies to Strength- and Dexterity-based skills.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":138,"Name":"Shield Slam","Description":"In the right position, your shield can be used to send opponents flying.","Benefit":"Any opponents hit by your shield bash are also hit with a free bull rush attack, substituting your attack roll for the combat maneuver check (see Chapter 8). This bull rush does not provoke an attack of opportunity. Opponents who cannot move back due to a wall or other surface are knocked prone after moving the maximum possible distance. You may choose to move with your target if you are able to take a 5-foot step or to spend an action to move this turn.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":95},{"RequirementType":6,"Value":137},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":139,"Name":"Shot on the Run","Description":"You can move, fire a ranged weapon, and move again before your foes can react.","Benefit":"As a full-round action, you can move up to your speed and make a single ranged attack at any point during your movement.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":140,"Name":"Sickening Critical","Description":"Your critical hits cause opponents to become sickened.","Benefit":"Whenever you score a critical hit, your opponent becomes sickened for 1 minute. The effects of this feat do not stack. Additional hits instead add to the effect's duration.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":142,"Name":"Simple Weapon Proficiency","Description":"You are trained in the use of basic weapons.","Benefit":"You make attack rolls with simple weapons without penalty.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":144,"Name":"Snatch Arrows","Description":"Instead of knocking an arrow or ranged attack aside, you can catch it in mid-flight.","Benefit":"When using the Def lect Arrows feat you may choose to catch the weapon instead of just def lecting it. Thrown weapons can immediately be thrown back as an attack against the original attacker (even though it isn't your turn) or kept for later use. You must have at least one hand free (holding nothing) to use this feat.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":39},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":148,"Name":"Spellbreaker","Description":"You can strike at enemy spellcasters who fail to cast defensively when you threaten them.","Benefit":"Enemies in your threatened area that fail their checks to cast spells defensively provoke attacks of opportunity from you.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":10},{"RequirementType":6,"Value":42}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":150,"Name":"Spring Attack","Description":"You can deftly move up to a foe, strike, and withdraw before he can react.","Benefit":"As a full-round action, you can move up to your speed and make a single melee attack without provoking any attacks of opportunity from the target of your attack. You can move both before and after the attack, but you must move at least 10 feet before the attack and the total distance that you move cannot be greater than your speed. You cannot use this ability to attack a foe that is adjacent to you at the start of your turn.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":151,"Name":"Staggering Critical","Description":"Your critical hits cause opponents to slow down.","Benefit":"Whenever you score a critical hit, your opponent becomes staggered for 1d4+1 rounds. A successful Fortitude save reduces the duration to 1 round. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":152,"Name":"Stand Still","Description":"You can stop foes that try to move past you.","Benefit":"When a foe provokes an attack of opportunity due to moving through your adjacent squares, you can make a combat maneuver check as your attack of opportunity. If successful, the enemy cannot move for the rest of his turn. An enemy can still take the rest of his action, but cannot move. This feat also applies to any creature that attempts to move from a square that is adjacent to you if such movement provokes an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":24}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":154,"Name":"Step Up","Description":"You can close the distance when a foe tries to move away.","Benefit":"Whenever an adjacent foe attempts to take a 5-foot step away from you, you may also make a 5-foot step as an immediate action so long as you end up adjacent to the foe that triggered this ability. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total movement.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":156,"Name":"Strike Back","Description":"You can strike at foes that attack you using their superior reach, by targeting their limbs or weapons as they come at you.","Benefit":"You can ready an action to make a melee attack against any foe that attacks you in melee, even if the foe is outside of your reach.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":157,"Name":"Stunning Critical","Description":"Your critical hits cause opponents to become stunned.","Benefit":"Whenever you score a critical hit, your opponent becomes stunned for 1d4 rounds. A successful Fortitude save reduces this to staggered for 1d4 rounds. The DC of this Fortitude save is equal to 10 + your base attack bonus. The effects of this feat do not stack. Additional hits instead add to the duration.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":17},{"RequirementType":6,"Value":31},{"RequirementType":6,"Value":151}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":158,"Name":"Stunning Fist","Description":"You know just where to strike to temporarily stun a foe.","Benefit":"You must declare that you are using this feat before you make your attack roll (thus, a failed attack roll ruins the attempt). Stunning Fist forces a foe damaged by your unarmed attack to make a Fortitude saving throw (DC 10 + 1/2 your character level + your Wis modifier), in addition to dealing damage normally. A defender who fails this saving throw is stunned for 1 round (until just before your next turn). A stunned character drops everything held, can't take actions, loses any Dexterity bonus to AC, and takes a -2 penalty to AC. You may attempt a stunning attack once per day for every four levels you have attained (but see Special), and no more than once per round. Constructs, oozes, plants, undead, incorporeal creatures, and creatures immune to critical hits cannot be stunned.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":4,"Value":13},{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":159,"Name":"Throw Anything","Description":"You are used to throwing things you have on hand.","Benefit":"You do not suffer any penalties for using an improvised ranged weapon. You receive a +1 circumstance bonus on attack rolls made with thrown splash weapons.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":160,"Name":"Tiring Critical","Description":"Your critical hits cause opponents to become fatigued.","Benefit":"Whenever you score a critical hit, your opponent becomes fatigued. This feat has no additional effect on a fatigued or exhausted creature.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":162,"Name":"Tower Shield Proficiency","Description":"You are trained in how to properly use a tower shield.","Benefit":"When you use a tower shield, the shield's armor check penalty only applies to Strength and Dexterity-based skills.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":165,"Name":"Two-Weapon Defense","Description":"You are skilled at defending yourself while dual-wielding.","Benefit":"When wielding a double weapon or two weapons (not including natural weapons or unarmed strikes), you gain a +1 shield bonus to your AC. When you are fighting defensively or using the total defense action, this shield bonus increases to +2.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":166,"Name":"Two-Weapon Fighting","Description":"You can fight with a weapon wielded in each of your hands. You can make one extra attack each round with the secondary weapon.","Benefit":"Your penalties on attack rolls for fighting with two weapons are reduced. The penalty for your primary hand lessens by 2 and the one for your off hand lessens by 6. See Two-Weapon Fighting in Chapter 8.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":167,"Name":"Two-Weapon Rend","Description":"Striking with both of your weapons simultaneously, you can use them to deliver devastating wounds.","Benefit":"If you hit an opponent with both your primary hand and your off-hand weapon, you deal an additional 1d10 points of damage plus 1-1/2 times your Strength modifier. You can only deal this additional damage once each round.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":44},{"RequirementType":6,"Value":98},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":169,"Name":"Vital Strike","Description":"You make a single attack that deals significantly more damage than normal.","Benefit":"When you use the attack action, you can make one attack at your highest base attack bonus that deals additional damage. Roll the weapon's damage dice for the attack twice and add the results together before adding bonuses from Strength, weapon abilities (such as flaming), precision-based damage, and other damage bonuses. These extra weapon damage dice are not multiplied on a critical hit, but are added to the total.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":170,"Name":"Weapon Finesse","Description":"You are trained in using your agility in melee combat, as opposed to brute strength.","Benefit":"With a light weapon, elven curve blade, rapier, whip, or spiked chain made for a creature of your size category, you may use your Dexterity modifier instead of your Strength modifier on attack rolls. If you carry a shield, its armor check penalty applies to your attack rolls.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":173,"Name":"Whirlwind Attack","Description":"You can strike out at every foe within reach.","Benefit":"When you use the full-attack action, you can give up your regular attacks and instead make one melee attack at your highest base attack bonus against each opponent within reach. You must make a separate attack roll against each opponent. When you use the Whirlwind Attack feat, you also forfeit any bonus or extra attacks granted by other feats, spells, or abilities.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114},{"RequirementType":6,"Value":150}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":175,"Name":"Wind Stance","Description":"Your erratic movements make it difficult for enemies to pinpoint your location.","Benefit":"If you move more than 5 feet this turn, you gain 20% concealment for 1 round against ranged attacks.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":43}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":194,"Name":"Bashing Finish","Description":"You follow a powerful blow from your weapon with an opportunistic bash from your shield.","Benefit":"Whenever you score a critical hit with a melee weapon, you can make a shield bash attack against the same target using the same bonus as a free action.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":95},{"RequirementType":6,"Value":1481},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":195,"Name":"Bloody Assault","Description":"Sacrificing accuracy, you can inflict bloody wounds that are slow to heal.","Benefit":"You can choose to take a -5 penalty on all melee attack rolls and combat maneuver checks to inflict 1d4 points of bleed damage with your weapon melee attacks, in addition to the normal damage dealt by the weapon. A creature continues to take bleed damage every round at the start of its turn. Bleed damage can be stopped by a DC 15 Heal check or through any magical healing. Bleed damage from this feat does not stack with itself. You must choose to use this feat before making the attack roll, and its effects last until your next turn (although the bleeding lasts until healed, as normal).","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":196,"Name":"Bodyguard","Description":"Your swift strikes ward off enemies attacking nearby allies.","Benefit":"When an adjacent ally is attacked, you may use an attack of opportunity to attempt the aid another action to improve your ally's AC. You may not use the aid another action to improve your ally's attack roll with this attack.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":24}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":199,"Name":"Bull Rush Strike","Description":"Your critical hits can push back your foes.","Benefit":"Whenever you score a critical hit with a melee attack, you can push your opponent back, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may push your opponent back as if from the bull rush combat maneuver. You do not need to move with the target if successful. This does not provoke an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":81},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":200,"Name":"Charge Through","Description":"You can overrun enemies when charging.","Benefit":"When making a charge, you can attempt to overrun one creature in the path of the charge as a free action. If you successfully overrun that creature, you can complete the charge. If the overrun is unsuccessful, the charge ends in the space directly in front of that creature.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":93},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":203,"Name":"Cockatrice Strike","Description":"With a single strike, you transmute flesh to stone.","Benefit":"As a full-round action, you can make a single unarmed strike against a dazed, flat-footed, paralyzed, staggered, stunned, or unconscious foe. If that attack is a critical hit, the target is petrified unless it succeeds on a Fortitude saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier. This is a supernatural polymorph effect.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":14},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":62},{"RequirementType":6,"Value":113}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":204,"Name":"Combat Patrol","Description":"You range across the battlefield, dealing with threats wherever they arise.","Benefit":"As a full-round action, you may set up a combat patrol, increasing your threatened area by 5 feet for every 5 points of your base attack bonus. Until the beginning of your next turn, you may make attacks of opportunity against any opponent in this threatened area that provokes attacks of opportunity. You may move as part of these attacks, provided your total movement before your next turn does not exceed your speed. Any movement you make provokes attacks of opportunity as normal.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":206,"Name":"Coordinated Defense","Description":"You are adept at working with allies to avoid being tripped, grappled, and subjected to other maneuvers.","Benefit":"Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus to your Combat Maneuver Defense. This bonus increases to +4 if the creature attempting the maneuver is larger than both you and your ally.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":207,"Name":"Coordinated Maneuvers","Description":"You are skilled at working with your allies to perform dangerous combat maneuvers.","Benefit":"Whenever you are adjacent to an ally who also has this feat, you receive a +2 competence bonus on all combat maneuver checks. This bonus increases to +4 when attempting to break free from a grapple.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":209,"Name":"Covering Defense","Description":"You are skilled at protecting yourself and your allies with your shield.","Benefit":"When you use the total defense action while using a light, heavy, or tower shield, you can provide a cover bonus to AC against all attacks to an adjacent ally your size or smaller. This cover bonus is equal to your shield's shield bonus and lasts until the beginning of your next turn. Your shield does not provide a cover bonus to Ref lex saves.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":136}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":210,"Name":"Crippling Critical","Description":"You are able to maim a target and hinder its movement.","Benefit":"Whenever you score a critical hit against an opponent, its speed is halved for 1 minute. A successful Fortitude save reduces this duration to 1d4 rounds. The DC of this save is equal to 10 + your base attack bonus. Against creatures with multiple types of movement, you must choose which movement type to affect. A flying creature hit by this attack must make a DC 10 Fly check to remain airborne, and has its maneuverability reduced by one step.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":211,"Name":"Crossbow Mastery","Description":"You can load crossbows with blinding speed and even fire them in melee with little fear of reprisal.","Benefit":"The time required for you to reload any type of crossbow is reduced to a free action, regardless of the type of crossbow used. You can fire a crossbow as many times in a full attack action as you could attack if you were using a bow. Reloading a crossbow for the type of crossbow you chose when you took Rapid Reload no longer provokes attacks of opportunity.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":1053},{"RequirementType":6,"Value":128}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":213,"Name":"Dazing Assault","Description":"You can daze foes with wild attacks.","Benefit":"You can choose to take a -5 penalty on all melee attack rolls and combat maneuver checks to daze opponents you hit with your melee attacks for 1 round, in addition to the normal damage dealt by the attack. A successful Fortitude save negates the effect. The DC of this save is 10 + your base attack bonus. You must choose to use this feat before making the attack roll, and its effects last until your next turn.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":217,"Name":"Disarming Strike","Description":"Your critical hits can disarm your foes.","Benefit":"Whenever you score a critical hit with a melee attack, you can disarm your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may disarm your opponent as if from the disarm combat maneuver. This does not provoke an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":85}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":218,"Name":"Disrupting Shot","Description":"With a well-placed shot, you make it harder for a nearby opponent to cast spells.","Benefit":"If you ready an action to shoot an opponent casting a spell within 30 feet and successfully hit that opponent with a ranged attack, the concentration DC to successfully cast the spell is increased by +4.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":9,"Value":6},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":221,"Name":"Dreadful Carnage","Description":"Slaying an enemy demoralizes your other nearby foes.","Benefit":"Whenever you reduce an enemy to 0 or fewer hit points, you can make an Intimidate check to demoralize all enemies within 30 feet as a free action. Enemies that cannot see both you and the enemy you reduced to 0 or fewer hit points are unaffected.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":15},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":123},{"RequirementType":6,"Value":246}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":227,"Name":"Elemental Fist","Description":"You empower your strike with elemental energy","Benefit":"When you use Elemental Strike pick one of the following energy types: acid, cold, electricity, or fire. On a successful hit, the attack deals damage normally plus 1d6 points of damage of the chosen type. You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). You may attempt an elemental fist attack once per day for every four levels you have attained (see Special), and no more than once per round.","FeatType":1,"Requirements":[{"RequirementType":2,"Value":13},{"RequirementType":4,"Value":13},{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":230,"Name":"Elven Accuracy","Description":"Your sharp eyesight makes difficult shots easier.","Benefit":"If you miss due to concealment when making a ranged attack with a longbow or shortbow (including composite bows), you can reroll your miss chance roll one time to see if you actually hit.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":245,"Name":"Following Step","Description":"You can repeatedly close the distance when foes try to move away, without impeding your normal movement.","Benefit":"When using the Step Up feat to follow an adjacent foe, you may move up to 10 feet. You may still take a 5-foot step during your next turn, and any movement you make using this feat does not subtract any distance from your movement during your next turn.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":154}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":246,"Name":"Furious Focus","Description":"Even in the midst of fierce and furious blows, you can find focus in the carnage and your seemingly wild blows strike home.","Benefit":"When you are wielding a two-handed weapon or a one-handed weapon with two hands, and using the Power Attack feat, you do not suffer Power Attack's penalty on melee attack rolls on the first attack you make each turn. You still suffer the penalty on any additional attacks, including attacks of opportunity.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":247,"Name":"Gang Up","Description":"You are adept at using greater numbers against foes.","Benefit":"You are considered to be flanking an opponent if at least two of your allies are threatening that opponent, regardless of your actual positioning.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":251,"Name":"Greater Dirty Trick","Description":"When you pull a dirty trick, your foe is truly hindered.","Benefit":"You receive a +2 bonus on checks made to attempt a dirty trick. This bonus stacks with the bonus granted by Improved Dirty Trick. Whenever you successfully perform a dirty trick, the penalty lasts for 1d4 rounds, plus 1 round for every 5 by which your attack exceeds the target's CMD. In addition, removing the condition requires the target to spend a standard action.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":261}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":252,"Name":"Greater Drag","Description":"Foes that you drag are thrown out of balance.","Benefit":"You receive a +2 bonus on checks made to drag a foe. This bonus stacks with the bonus granted by Improved Drag. Whenever you drag a foe, his movement provokes attacks of opportunity from all of your allies (but not you).","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":262},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":254,"Name":"Greater Reposition","Description":"When you reposition foes, they are left vulnerable to the attacks of your allies.","Benefit":"You receive a +2 bonus on checks made to reposition a foe. This bonus stacks with the bonus granted by Improved Reposition. Whenever you reposition a foe, his movement provokes attacks of opportunity from all of your allies (but not you).","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":264}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":256,"Name":"Greater Steal","Description":"You have a knack for snatching items from your opponents in combat.","Benefit":"You receive a +2 bonus on checks made to steal an item from a foe. This bonus stacks with the bonus granted by Improved Steal. If you successfully steal an item from a foe during combat, it does not notice the theft until after combat is over or if it attempts to use the missing item.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":268}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":261,"Name":"Improved Dirty Trick","Description":"You are skilled at pulling dirty tricks on your foes.","Benefit":"You do not provoke an attack of opportunity when performing a dirty trick combat maneuver. In addition, you receive a +2 bonus on checks made to attempt a dirty trick. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries a dirty trick on you.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":262,"Name":"Improved Drag","Description":"You are skilled at dragging foes around the battlefield.","Benefit":"You do not provoke an attack of opportunity when performing a drag combat maneuver. In addition, you receive a +2 bonus on checks made to drag a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to drag you.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":263,"Name":"Improved Ki Throw","Description":"Your enemies are living weapons in your hands.","Benefit":"When using the Ki Throw feat, you may throw your target into any square you threaten that is occupied by another creature. Make a bull rush combat maneuver check with a -4 penalty against the secondary target. If this check succeeds, the thrown creature lands prone in the secondary target's square, while the secondary target is pushed back and knocked prone in an adjacent square. If the check fails, the thrown creature lands prone in the nearest square you threaten adjacent to the secondary target. If you throw a Large or larger creature into an area containing multiple secondary targets, you take an additional penalty of -4 on your combat maneuver check for each target after the first.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":81},{"RequirementType":6,"Value":275}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":264,"Name":"Improved Reposition","Description":"You have learned how to force your enemies to move around the battlefield.","Benefit":"You do not provoke an attack of opportunity when performing a reposition combat maneuver. In addition, you receive a +2 bonus on checks made to reposition a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to reposition you.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":265,"Name":"Improved Second Chance","Description":"You can turn a missed strike into a second chance without sacrificing later attacks.","Benefit":"When you reroll a missed attack using the Second Chance feat, you can still make the rest of your attacks that turn, albeit at a -5 penalty to each attack.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":311}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":267,"Name":"Improved Sidestep","Description":"You are adept at sidestepping your opponent's melee attacks without compromising your mobility.","Benefit":"After sidestepping an opponent's missed attack using the Sidestep feat, you may still take a 5-foot step during your next turn, or you may move up to your full speed if you take an action to move during your next turn.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114},{"RequirementType":6,"Value":321}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":268,"Name":"Improved Steal","Description":"You have a knack for snatching items from your opponents.","Benefit":"You do not provoke an attack of opportunity when performing a steal combat maneuver. In addition, you receive a +2 bonus on checks made to steal an item from a foe. You also receive a +2 bonus to your Combat Maneuver Defense when an opponent tries to steal an item from you.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":271,"Name":"In Harm's Way","Description":"You put yourself in danger's path to save your allies.","Benefit":"While using the aid another action to improve an adjacent ally's AC, you can intercept a successful attack against that ally as an immediate action, taking full damage from that attack and any associated effects (bleed, poison, etc.). A creature cannot benefit from this feat more than once per attack.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":196}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":275,"Name":"Ki Throw","Description":"Your physical control and mastery of momentum allows you to throw enemies.","Benefit":"On a successful unarmed trip attack against a target your size or smaller, you may throw the target prone in any square you threaten rather than its own square. This movement does not provoke attacks of opportunity, and you cannot throw the creature into a space occupied by other creatures.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":97},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":280,"Name":"Lookout","Description":"Your allies help you avoid being surprised.","Benefit":"Whenever you are adjacent to an ally who also has this feat, you may act in the surprise round as long as your ally would normally be able to act in the surprise round. If you would normally be denied the ability to act in the surprise round, your initiative is equal to your initiative roll or the roll of your ally -1, whichever is lower. If both you and your ally would be able to act in the surprise round without the aid of this feat, you may take both a standard and a move action (or a full-round action) during the surprise round.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":287,"Name":"Missile Shield","Description":"You are skilled at def lecting ranged attacks with your shield.","Benefit":"You must be using a light, heavy, or tower shield to use this feat. Once per round when you would normally be hit with an attack from a ranged weapon (not including spell effects, natural attacks, or massive ranged weapons), you may def lect it so that you take no damage, as if you had the Def lect Arrows feat. You must be aware of the attack and not flat-footed.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":136}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":288,"Name":"Mounted Shield","Description":"Your defensive tactics defend both you and your mount.","Benefit":"You may add your base shield bonus (including the bonus from Shield Focus but not including enhancement bonuses) to your mount's AC. In addition, you may add this bonus when making a Ride check to negate a hit against your mount using the Mounted Combat feat.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":116},{"RequirementType":6,"Value":136}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":290,"Name":"Outflank","Description":"You look for every edge when flanking an enemy.","Benefit":"Whenever you and an ally who also has this feat are flanking the same creature, your flanking bonus on attack rolls increases to +4. In addition, whenever you score a critical hit against the flanked creature, it provokes an attack of opportunity from your ally.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":4}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":291,"Name":"Paired Opportunists","Description":"You know how to make an enemy pay for lax defenses.","Benefit":"Whenever you are adjacent to an ally who also has this feat, you receive a +4 circumstance bonus on attacks of opportunity against creatures that you both threaten. Enemies that provoke attacks of opportunity from your ally also provoke attacks of opportunity from you so long as you threaten them (even if the situation or an ability would normally deny you the attack of opportunity). This does not allow you to take more than one attack of opportunity against a creature for a given action.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":295,"Name":"Perfect Strike","Description":"When wielding a monk weapon, your attacks can be extremely precise.","Benefit":"You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). You must use one of the following weapons to make the attack: kama, nunchaku, quarterstaff, sai, and siangham. You can roll your attack roll twice and take the higher result. If one of these rolls is a critical threat, the other roll is used as your confirmation roll (your choice if they are both critical threats). You may attempt a perfect attack once per day for every four levels you have attained (but see Special), and no more than once per round.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":4,"Value":13},{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":299,"Name":"Precise Strike","Description":"You are skilled at striking where it counts, as long as an ally distracts your foe.","Benefit":"Whenever you and an ally who also has this feat are flanking the same the creature, you deal an additional 1d6 points of precision damage with each successful melee attack. This bonus damage stacks with other sources of precision damage, such as sneak attack. This bonus damage is not multiplied on a critical hit.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":301,"Name":"Punishing Kick","Description":"Your kicks are so powerful you use them to push or knock back your foes.","Benefit":"You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). On a successful hit, the attack deals damage normally and you can choose to push your target 5 feet or attempt to knock them prone. If you decide to push the target, it is moved 5 feet directly away from you. This movement does not provoke attacks of opportunity, and the target must end this move in a safe space it can stand in. If you decide to attempt to knock the target prone, the target receives a Fortitude saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier to avoid the effect. You may attempt a punishing kick attack once per day for every four levels you have attained (but see Special), and no more than once per round.","FeatType":1,"Requirements":[{"RequirementType":2,"Value":13},{"RequirementType":4,"Value":13},{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":302,"Name":"Pushing Assault","Description":"A strike made with a two-handed weapon can push a similar sized opponent backward.","Benefit":"When you hit a creature your size or smaller with a two-handed weapon attack modif ied by the Power Attack feat, you can choose to push the target 5 feet directly away from you instead of dealing the extra damage from Power Attack. If you score a critical hit, you can instead push the target 10 feet directly away from you. This movement does not provoke attacks of opportunities, and the target must end this move in a safe space it can stand in. You choose which effect to apply after the attack roll has been made, but before the damage is rolled.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":15},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":305,"Name":"Ray Shield","Description":"You can even deflect rays with your shield.","Benefit":"You must be using a light, heavy, or tower shield to use this feat. Once per round when you would normally be hit with a ranged touch attack (including rays and similar magical effects), you may def lect it so that you take no damage from it. Your shield suffers the full effects of the spell or effect, if applicable.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":6,"Value":287},{"RequirementType":6,"Value":148}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":309,"Name":"Repositioning Strike","Description":"Your critical hits can move your foes where you wish.","Benefit":"Whenever you score a critical hit with a melee attack, you can move your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may move your opponent as if from the reposition combat maneuver. This does not provoke an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":264}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":310,"Name":"Saving Shield","Description":"You deflect attacks that could mean your ally's death.","Benefit":"Whenever an adjacent ally is the target of an attack, you can, as an immediate action, grant that adjacent ally a +2 shield bonus to AC. You must be wielding a light shield, heavy shield, or tower shield to use this feat.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":311,"Name":"Second Chance","Description":"Quick ref lexes turn missed strikes into second chances.","Benefit":"When making a full attack, if you miss on your first attack, you can forgo making any other attacks for the rest of your turn to reroll that attack at your highest base attack bonus.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":313,"Name":"Shadow Strike","Description":"You accurately strike even those you cannot clearly see.","Benefit":"You can deal precision damage, such as sneak attack damage, against targets with concealment (but not total concealment).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":316,"Name":"Shield of Swings","Description":"A wild frenzy of attacks serves to bolster your defenses.","Benefit":"When you take a full-attack action while wielding a two-handed weapon, you can choose to reduce the damage by 1/2 to gain a +4 shield bonus to AC and CMD until the beginning of your next turn. The reduction in damage applies until the beginning of your next turn.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":318,"Name":"Shield Wall","Description":"You form a unified defense with those around you.","Benefit":"Whenever you are wielding a shield and are adjacent to an ally wielding a shield who also has this feat, the AC bonus from your shield increases, depending on the shield wielded by your ally. If your ally is wielding a buckler or a light shield, your shield bonus increases by +1. If your ally is wielding a heavy shield or a tower shield, your shield bonus increases by +2. You keep these bonuses even if your ally loses his shield bonus due to making a shield bash attack. If an adjacent ally with this feat uses a tower shield to grant total cover, you also benefit if an attack targeting you passes through the edge of the shield (Core Rulebook 153).","FeatType":1,"Requirements":[{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":321,"Name":"Sidestep","Description":"You can reposition yourself after a foe's missed swing.","Benefit":"Whenever an opponent misses you with a melee attack, you may move 5 feet as an immediate action so long as you remain within that opponent's threatened area. This movement does not provoke attacks of opportunity. If you take this step, you cannot take a 5-foot step during your next turn. If you take an action to move during your next turn, subtract 5 feet from your total movement.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":322,"Name":"Smash","Description":"You overcome obstacles by breaking them.","Benefit":"When you attack an inanimate, unattended object, you ignore the first 5 points of its hardness. You also receive a +5 bonus on Strength checks made to knock down or break open doors.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":327,"Name":"Stabbing Shot","Description":"You can clear the way to continue using your bow.","Benefit":"When adjacent to an opponent and making a full-attack action with a longbow or shortbow (including composite bows), you may choose to make a melee attack against that opponent with a drawn arrow rather than firing it. If the attack hits-whether or not it does damage-your target is pushed back 5 feet away from you. You can then fire arrows from your bow normally, at the original target, or at another target within range. This melee attack replaces the extra attack from Rapid Shot, and all of your attack rolls for the round (the melee attack and the ranged attacks) take a -2 penalty. If your initial attack leaves you with no enemies threatening you, you can make the subsequent ranged attack or attacks without provoking attacks of opportunity.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":128}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":329,"Name":"Step Up and Strike","Description":"When a foe tries to move away, you can follow and make an attack.","Benefit":"When using the Step Up or Following Step feats to follow an adjacent foe, you may also make a single melee attack against that foe at your highest base attack bonus. This attack counts as one of your attacks of opportunity for the round. Using this feat does not count toward the number of actions you can usually take each round.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":245},{"RequirementType":6,"Value":154}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":333,"Name":"Stunning Assault","Description":"You powerful but imprecise attacks can stun your enemies.","Benefit":"You can choose to take a -5 penalty on all melee attack rolls and combat maneuver checks to stun targets you hit with your melee attacks for 1 round. A successful Fortitude save negates the effect. The DC of this save is 10 + your base attack bonus. You must choose to use this feat before making the attack roll, and its effects last until your next turn.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":16},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":335,"Name":"Sundering Strike","Description":"Your critical hits can sunder your foes' weapons.","Benefit":"Whenever you score a critical hit with a melee attack, you can sunder your opponent's weapon, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may deal damage to your opponent's weapon as if from the sunder combat maneuver (roll normal damage to the weapon separately). This does not provoke an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":96},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":336,"Name":"Swap Places","Description":"You are skilled at changing places with your ally during a chaotic melee.","Benefit":"Whenever you are adjacent to an ally who also has this feat, you can move into your ally's square as part of normal movement. At the same time, your ally moves into your previous space as an immediate action. Both you and your ally must be willing and able to move to take advantage of this feat. Your ally must be the same size as you to utilize this feat. Your ally does not provoke an attack of opportunity from this movement, but you provoke as normal. This movement does not count against your ally's movement on his next turn.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":337,"Name":"Swift Aid","Description":"With a quick but harmless swipe, you can aid an ally's assault.","Benefit":"As a swift action, you can attempt the aid another action, granting your ally either a +1 bonus on his next attack roll or a +1 bonus to his AC.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":339,"Name":"Team Up","Description":"When you are ganging up against an enemy, you can aid an ally with a quick feint.","Benefit":"When you and at least two of your allies are adjacent to an opponent, you can attempt the aid another action as a move action.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":247}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":340,"Name":"Teleport Tactician","Description":"You are highly alert for enemies using teleportation to approach you or flee from you.","Benefit":"Any creature using a teleportation effect to enter or leave a square threatened by you provokes an attack of opportunity, even if casting defensively or using a supernatural ability.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":42},{"RequirementType":6,"Value":148}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":343,"Name":"Touch of Serenity","Description":"With a single touch you can reduce the threat of even the most savage of foes.","Benefit":"You must declare that you are using this feat before you make your attack roll (thus a failed attack roll ruins the attempt). On a successful hit, the attack deals no damage and bestows no other effect or condition, but the target cannot cast spells or attack (including attacks of opportunity and attacks as immediate actions) for 1 round unless it succeeds on a Will saving throw with a DC of 10 + 1/2 your character level + your Wisdom modifier. You may attempt a touch of serenity once per day for every four levels you have attained (but see Special), and no more than once per round.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":18},{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":345,"Name":"Tripping Strike","Description":"The force intrinsic to your critical hits can knock your foes down.","Benefit":"Whenever you score a critical hit with a melee attack, you can trip your opponent, in addition to the normal damage dealt by the attack. If your confirmation roll exceeds your opponent's CMD, you may knock your opponent prone as if from the trip combat maneuver. This does not provoke an attack of opportunity. If you are tripped during your own trip attempt, you can drop your weapon to avoid being tripped.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":354,"Name":"Arc Slinger","Description":"You can twirl your sling in a way that maximizes its effectiveness.","Benefit":"When using a sling or sling staff, you reduce your penalty on ranged attack rolls due to range by 2. Point-Blank Shot's damage bonus applies within the first normal range increment of your sling (50 feet) or sling staff (80 feet).","FeatType":1,"Requirements":[{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":357,"Name":"Binding Throw","Description":"You can strike your enemy and use the blow as an opportunity to grab and hold him.","Benefit":"After you successfully use the Ki Throw feat on an opponent, you can use a swift action to attempt a grapple combat maneuver against that opponent.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":97},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":275}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":358,"Name":"Bludgeoner","Description":"You can knock foes out cold with just about any blunt instrument.","Benefit":"You take no penalty on attack rolls for using a lethal bludgeoning weapon to deal nonlethal damage.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":362,"Name":"Body Shield","Description":"With a sly maneuver, you force a grappled opponent into the path of an incoming attack.","Benefit":"As an immediate action while you are grappling an adjacent creature, you can make a grapple combat maneuver check against that creature to gain cover against a single attack. If you are successful and the attack misses you, that attack targets the creature you used as cover, using the same attack roll. You cannot use this feat against a creature grappling you, and the cover you gain ends after the attack you gained cover against is resolved.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":366,"Name":"Break Guard","Description":"You can use one of your two weapons to occupy your opponent's defenses while attacking with the other.","Benefit":"While wielding two weapons, whenever you successfully use one weapon to disarm an opponent, you can spend a swift action to attack the opponent you attempted to disarm using your other weapon.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":85},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":369,"Name":"Cavalry Formation","Description":"You are skilled at riding in close formation with your mounted allies without impeding your effectiveness on the battlefield.","Benefit":"You and your mount can overlap the space of mounts whose riders have this feat, although no more than two creatures can share any one square. Further, you can charge through a space containing an allied mount if that mount's rider has this feat, although the space from which you make your charge attack must comply with this feat's other benefit or be unoccupied.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":116}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":372,"Name":"Charging Hurler","Description":"You know how to use your momentum to enhance your thrown weapon attacks.","Benefit":"You can use the charge rules to make a thrown weapon attack. All the parameters of a charge apply, except that you must only move closer to your opponent, and you must end your movement within 30 feet of that opponent. If you do, you can make a single thrown weapon attack against that opponent, gaining the +2 bonus on the attack roll and taking a -2 penalty to your AC until the start of your next turn.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":373,"Name":"Chokehold","Description":"While grappling, you can cut off an opponent's air and blood supply.","Benefit":"While you have an opponent up to one size category larger than you grappled, you can attempt a grapple combat maneuver with a -5 penalty on the check. If you succeed, you have pinned your opponent and hold the opponent in a chokehold. When you maintain the grapple, you also maintain the chokehold. A creature in a chokehold cannot breathe or speak, and thus cannot cast spells that have a verbal component. An opponent you have in a chokehold has to hold his breath or begin suffocating. Any creature that does not breathe, is immune to bleed damage, or is immune to critical hits is immune to the effects of your chokehold. When the grapple is ended, so is the chokehold.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":374,"Name":"Cleaving Finish","Description":"When you strike down an opponent, you can continue your swing into another target.","Benefit":"If you make a melee attack, and your target drops to 0 or fewer hit points as a result of your attack, you can make another melee attack using your highest base attack bonus against another opponent within reach. You can make only one extra attack per round with this feat.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":376,"Name":"Clustered Shots","Description":"You take a moment to carefully aim your shots, causing them all to strike nearly the same spot.","Benefit":"When you use a full-attack action to make multiple ranged weapon attacks against the same opponent, total the damage from all hits before applying that opponent's damage reduction.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":124}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":381,"Name":"Crane Riposte","Description":"You use your defensive abilities to make overpowering counterattacks.","Benefit":"You take only a -1 penalty on attack rolls for fighting defensively. Whenever you are fighting defensively, and you use Crane Wing to add a dodge bonus against one attack, that attack provokes an attack of opportunity from you if it misses. In addition, when you deflect an attack using Crane Wing while taking the total defense action, you may make an attack of opportunity against that opponent (even though you could not normally do so while taking the total defense action).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":382},{"RequirementType":6,"Value":383},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":382,"Name":"Crane Style","Description":"Your unarmed fighting techniques blend poise with graceful defense.","Benefit":"You take only a -2 penalty on attack rolls for f ighting defensively. While using this style and fighting defensively or using the total defense action, you gain an additional +1 dodge bonus to your Armor Class.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":2},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":383,"Name":"Crane Wing","Description":"You move with the speed and finesse of an avian hunter, your sweeping blocks and graceful motions allowing you to deflect melee attacks with ease.","Benefit":"Once per round, when fighting defensively with at least one hand free, you can designate one melee attack being made against you before the roll is made. You receive a +4 dodge bonus to AC against that attack. If you are using the total defense action instead, you can deflect one melee attack that would normally hit you. An attack so def lected deals no damage and has no other effect (instead treat it as a miss). You do not expend an action when using this feat, but you must be aware of the attack and not flat-footed.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":382},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":386,"Name":"Crushing Blow","Description":"Your focus allows you to smash your enemy's defenses.","Benefit":"You can make a Stunning Fist attempt as a full-round action. If successful, instead of stunning your target, you reduce the target's AC by an amount equal to your Wisdom modifier for 1 minute. This penalty does not stack with other penalties applied due to Crushing Blow.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":158}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":387,"Name":"Deadly Finish","Description":"Your attacks don't just fell your opponents-they kill them outright.","Benefit":"When you hit with a melee attack and reduce your opponent to -1 or fewer hit points, you can force that opponent to succeed at a Fortitude save (DC 15 + the damage your attack dealt) or die.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":388,"Name":"Death from Above","Description":"You allow gravity to add extra force to your charges.","Benefit":"Whenever you charge an opponent from higher ground, or from above while flying, you gain a +5 bonus on attack rolls in place of the bonuses from charging and being on higher ground.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":389,"Name":"Death or Glory","Description":"Even when facing a larger foe, you aren't afraid to take great risks in order to finish the fight.","Benefit":"Against a creature of size Large or larger, you can make a single melee attack as a full-round action, gaining a +4 bonus on the attack roll, damage roll, and critical confirmation roll. You gain an additional +1 on this bonus at base attack bonus +11, +16, and +20 (for a maximum of +7 at base attack +20). After you resolve your attack, the opponent you attack can spend an immediate action to make a single melee attack against you with the same bonuses.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":390,"Name":"Deathless Initiate","Description":"For you, impending death is a call to wrath.","Benefit":"You are not staggered while using the Diehard feat, but if you take a move and a standard action or a fullround action while you are at 0 or fewer hit points you take 1 point of damage. Further, while using the Diehard feat, you gain a +2 bonus on melee attacks and damage rolls.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":2,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":41},{"RequirementType":6,"Value":47}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":394,"Name":"Defensive Weapon Training","Description":"You know how to defend yourself against a certain class of weaponry.","Benefit":"Choose a weapon group from the fighter's weapon training class ability list (except natural weapons). You gain a +2 dodge bonus on AC when an opponent attacks you using a weapon from that group. If you also have the weapon training class feature in the selected group, your dodge bonus from this feat increases to +3.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":5}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":397,"Name":"Devastating Strike","Description":"Pitting all of your strength and resolve against your enemy, you deliver a strike that is impossible to ignore.","Benefit":"Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a +2 bonus on each extra weapon damage dice roll those feats grant (+6 maximum). This bonus damage is multiplied on a critical hit.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":169}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":404,"Name":"Disengaging Feint","Description":"You can feint to disengage from combat.","Benefit":"As a standard action, use Bluff to feint against an opponent. Instead of denying that opponent his Dexterity bonus to AC, a successful feint allows you to move up to your speed without provoking an attack of opportunity from the opponent you feinted for leaving the square you start in.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":87}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":405,"Name":"Disengaging Flourish","Description":"Distracting your opponents gives you the opportunity to make a swift retreat.","Benefit":"As a standard action, make a Bluff check against each opponent that currently threatens you. If you succeed against at least one opponent, you can move up to your speed. This movement does not provoke attacks of opportunity from any opponent you succeeded at feinting against.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":404},{"RequirementType":6,"Value":87}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":406,"Name":"Disengaging Shot","Description":"You make one last attack before beating a hasty retreat.","Benefit":"Whenever you use Disengaging Feint or Disengaging Flourish, you can make a single melee attack against one opponent you succeeded at feinting against. That opponent is denied his Dexterity bonus to AC against this attack.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":404},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":87},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":413,"Name":"Distance Thrower","Description":"You are accurate with thrown weapons at longer ranges than normal.","Benefit":"With a thrown weapon, you reduce your penalty on ranged attack rolls due to range by 2.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":419,"Name":"Drag Down","Description":"When you are knocked prone, you are skilled at bringing your opponent down with you.","Benefit":"Whenever an opponent successfully trips you, you can attempt to trip that opponent as an immediate action.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":423,"Name":"Dramatic Display","Description":"Your skill with your weapon is obvious to enemies and onlookers alike.","Benefit":"When you spend a swift action to make a performance check, you exude an aura of awe-inspiring skill. You gain a +2 bonus on your performance check, and gain a +2 bonus on all attack rolls and combat maneuver checks until the end of your next turn.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":33}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":438,"Name":"Felling Escape","Description":"Through the use of fluid contortions and manipulations of leverage, you can throw your opponent to the ground after escaping a grapple.","Benefit":"When you break an opponent's grapple with a combat maneuver check or Escape Artist check, you can spend a swift action to make a trip attempt against that opponent.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":439,"Name":"Felling Smash","Description":"You commit all your focus to a devastating blow, trying to crush your opponent to the ground.","Benefit":"If you use the attack action to make a single melee attack at your highest base attack bonus while using Power Attack and you hit an opponent, you can spend a swift action to attempt a trip combat maneuver against that opponent.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":445,"Name":"Flanking Foil","Description":"Fighting multiple foes is easy for you.","Benefit":"Whenever you hit an adjacent opponent with a melee attack, until the start of your next turn, that opponent does not gain any flanking bonus on attack rolls while it is f lanking you and cannot deal sneak attack damage to you. It can still provide a flank for its allies.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":448,"Name":"Gory Finish","Description":"By drawing upon wells of savagery, you can slay your foe in creative and horrifyingly gruesome manners, intimidating nearby foes.","Benefit":"When you use the attack action, you can use a weapon with which you have Weapon Focus to make a single attack at your highest base attack bonus. If you reduce your target to negative hit points, you can spend a swift action to make an Intimidate check to demoralize all foes within 30 feet who could see your attack.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":33},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":451,"Name":"Greater Snap Shot","Description":"You can prey on any gap in your foe's guard with impunity, and with even greater range.","Benefit":"Whenever you make an attack of opportunity using a ranged weapon and hit, you gain a +2 bonus on the damage roll and a +2 bonus on rolls to confirm a critical hit with that attack. These bonuses increase to +4 when you have base attack bonus +16, and to +6 when you have base attack bonus +20.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":10,"Value":12},{"RequirementType":6,"Value":472},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":128},{"RequirementType":6,"Value":574}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":455,"Name":"Hammer the Gap","Description":"You repeatedly strike the same location, causing increasing amounts of damage.","Benefit":"When you take a full-attack action, each consecutive hit against the same opponent deals extra damage equal to the number of previous consecutive hits you have made against that opponent this turn. This damage is multiplied on a critical hit.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":463,"Name":"Impact Critical Shot","Description":"With a series of ranged attacks, you bring your foes to their knees or force them to move.","Benefit":"Whenever you score a critical hit with a ranged attack, in addition to the normal damage your attack deals, if your confirmation roll exceeds your opponent's CMD, you can push your opponent back as if from the bull rush combat maneuver or knock that target prone as if from a trip combat maneuver. If you choose to bull rush, you cannot move with the target. Your maneuver does not provoke an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":466,"Name":"Improved Charging Hurler","Description":"Every muscle in your body adds its force to your thrown weapons.","Benefit":"When you use Charging Hurler, your target can be at any range up to your weapon's maximum range. If your target is within 30 feet, you gain a +2 bonus on damage rolls.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":372},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":467,"Name":"Improved Cleaving Finish","Description":"You can cut down many opponents in a single strike.","Benefit":"You can use Cleaving Finish any number of times per round.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":374},{"RequirementType":6,"Value":63},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":468,"Name":"Improved Devastating Strike","Description":"The fury and power channeled through your attack is enough to kill a lesser being outright.","Benefit":"Whenever you use Vital Strike, Improved Vital Strike, or Greater Vital Strike, you gain a bonus on attack rolls to confirm a critical hit equal to the bonus on damage rolls you gain from Devastating Strike.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":397},{"RequirementType":6,"Value":169}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":472,"Name":"Improved Snap Shot","Description":"You can take advantage of your opponent's vulnerabilities from a greater distance, and without exposing yourself.","Benefit":"You threaten an additional 10 feet with Snap Shot.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":128},{"RequirementType":6,"Value":574},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":474,"Name":"Improved Two-Weapon Feint","Description":"Your primary weapon keeps a foe off balance, allowing you to slip your off-hand weapon past his defenses.","Benefit":"While using Two-Weapon Fighting to make melee attacks, you can forgo your first primary-hand melee attack to make a Bluff check to feint an opponent. If you successfully feint, that opponent is denied his Dexterity bonus to AC until the end of your turn.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":17},{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":98},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":486,"Name":"Landing Roll","Description":"You have learned the technique of rolling safely away when an enemy trips you.","Benefit":"If you are tripped, you can spend an immediate action to move 5 feet without provoking an attack of opportunity. This does not count as taking a 5-foot step. You fall prone after this movement.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":518,"Name":"Opening Volley","Description":"Your ranged assault leaves your foe disoriented and vulnerable to your melee attack.","Benefit":"Whenever you deal damage with a ranged attack, you gain a +4 circumstance bonus on the next melee attack roll you make against the opponent. This attack must occur before the end of your next turn.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":519,"Name":"Pack Attack","Description":"You are skilled at surrounding your enemies.","Benefit":"When you are adjacent to an ally with this feat, the first time you melee attack an opponent, you can spend an immediate action to take a 5-foot step, even if you have otherwise moved this round.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":520,"Name":"Panther Claw","Description":"You unleash a rapid series of blows on foes that attempt to attack you when you move.","Benefit":"While using Panther Style, you can spend a free action, instead of spending a swift action, to make a retaliatory unarmed strike. You can make a number of retaliatory unarmed strikes on your turn equal to your Wisdom modifier.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":15},{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":522}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":521,"Name":"Panther Parry","Description":"Your vicious strikes impair your foe's ability to attack you when you move.","Benefit":"While using Panther Style, your retaliatory unarmed strikes are resolved before the triggering attacks. If your retaliatory unarmed strike deals damage to an opponent, that opponent takes a -2 penalty on attack and damage rolls with the triggering attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":15},{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":520},{"RequirementType":6,"Value":522}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":522,"Name":"Panther Style","Description":"You can strike back at enemies who attack you when you move.","Benefit":"While using this style, when an opponent makes an attack of opportunity against you for moving through a threatened square, you can spend a swift action to make a retaliatory unarmed strike attack against that opponent. Your attack is resolved after the triggering attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":13},{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":524,"Name":"Performance Weapon Mastery","Description":"You wield all your weapons with the flair of a performer.","Benefit":"You treat all weapons you are proficient in as if they had the performance weapon quality (page 144).","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":526,"Name":"Pin Down","Description":"You easily block enemy escapes.","Benefit":"Whenever an opponent you threaten takes a 5-foot step or uses the withdraw action, that opponent provokes an attack of opportunity from you. If the attack hits, you deal no damage, but the targeted creature is prevented from making the move action that granted a 5-foot step or the withdraw action and does not move.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":11},{"RequirementType":6,"Value":24}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":527,"Name":"Pinning Knockout","Description":"An opponent you have pinned is easy for you to knock out.","Benefit":"While you have an opponent pinned, when you succeed at a grapple combat maneuver check to deal an opponent nonlethal damage using an unarmed strike or a light or one-handed weapon, double your damage result. Any creature that is immune to critical hits is immune to the effects of this feat.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":68},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":528,"Name":"Pinning Rend","Description":"You tear flesh when you damage an opponent that you have pinned.","Benefit":"While you have an opponent pinned, when you succeed at a grapple combat maneuver check to deal an opponent damage using an unarmed strike or a light or one-handed weapon, that opponent also takes bleed damage equal to your unarmed strike or weapon damage dice. Any creature that is immune to critical hits is immune to the effects of this feat.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":68},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":532,"Name":"Prone Slinger","Description":"Your sideways sling release allows you to launch bullets and stones even while prone.","Benefit":"While prone, you can use a sling to make ranged attacks.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":533,"Name":"Quick Bull Rush","Description":"You can barrel into your opponent and follow this with an attack.","Benefit":"On your turn, you can perform a single bull rush combat maneuver in place of one of your melee attacks. You must choose the melee attack with the highest base attack bonus to make the bull rush.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":81},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":534,"Name":"Quick Dirty Trick","Description":"You can perpetrate a dirty trick and deliver an attack before your opponent is the wiser.","Benefit":"On your turn, you can perform a single dirty trick combat maneuver (Advanced Players Guide 320) in place of one of your melee attacks. You must choose the melee attack with the highest base attack bonus to make the dirty trick combat maneuver.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":261}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":535,"Name":"Quick Drag","Description":"You drag your enemy and deliver a punishing blow.","Benefit":"On your turn, you can perform a single drag combat maneuver (Advanced Players Guide 320) in place of one of your melee attacks. You must choose the melee attack with the highest base attack bonus to make the drag.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":262},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":536,"Name":"Quick Reposition","Description":"Your opponent becomes an unwitting dance partner, following your lead while you fight.","Benefit":"On your turn, you can perform a single reposition combat maneuver (Advanced Players Guide 320) in place of one of your melee attacks. You must choose the melee attack with the highest base attack bonus to make the reposition.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":264}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":537,"Name":"Quick Steal","Description":"You are adept at relieving foes of their belongings even while you strike.","Benefit":"On your turn, you can perform a single steal combat maneuver (Advanced Players Guide 320) in place of one of your melee attacks. You must choose the melee attack with the highest base attack bonus to make the steal.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":268}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":542,"Name":"Rapid Grappler","Description":"You are a quick hand at grappling.","Benefit":"Whenever you use Greater Grapple to successfully maintain a grapple as a move action, you can then spend a swift action to make a grapple combat maneuver check.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":68},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":553,"Name":"Savage Display","Description":"With your victory and a roar, you push yourself on with increased savagery.","Benefit":"When you spend a swift action to make a performance combat check, you gain a +2 bonus on your performance combat check and gain a +1d6 bonus on damage rolls until the end of your next turn. This extra damage is not precision damage.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":33}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":557,"Name":"Seize the Moment","Description":"You and your allies are poised to pounce whenever one of you scores a telling blow.","Benefit":"When an ally who also has this feat confirms a critical hit against an opponent that you also threaten, you can make an attack of opportunity against that opponent.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":84}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":574,"Name":"Snap Shot","Description":"With a ranged weapon, you can take advantage of any opening in your opponent's defenses.","Benefit":"While wielding a ranged weapon with which you have Weapon Focus, you threaten squares within 5 feet of you. You can make attacks of opportunity with that ranged weapon. You do not provoke attacks of opportunity when making a ranged attack as an attack of opportunity.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":128},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":575,"Name":"Snapping Turtle Clutch","Description":"Your unarmed style allows you to turn your opponent's attack into an opportunity.","Benefit":"While you are using the Snapping Turtle Style feat, the shield bonus the style grants to your AC applies to your CMD and touch AC. Whenever an opponent misses you with a melee attack while you are using the Snapping Turtle Style feat, you can use an immediate action to attempt a grapple combat maneuver against that opponent, but with a -2 penalty.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":3},{"RequirementType":6,"Value":577},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":576,"Name":"Snapping Turtle Shell","Description":"Your guarding hand is almost magical in its skill at def lecting incoming blows.","Benefit":"While you are using the Snapping Turtle Style feat, the shield bonus the style grants to your AC increases to +2, and your enemies take a -4 penalty on critical confirmation rolls against you.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":575},{"RequirementType":6,"Value":577},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":577,"Name":"Snapping Turtle Style","Description":"Your deft unarmed style allows you to shield your body from harm.","Benefit":"While using the Snapping Turtle Style feat with at least one hand free, you gain a +1 shield bonus to AC.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":579,"Name":"Sorcerous Strike","Description":"The power flowing through your veins also flows through your unarmed strike.","Benefit":"When you gain this feat, you choose one bloodline power that you can use to affect a single opponent. If you make a successful unarmed strike against an opponent, in addition to dealing your unarmed strike damage, you can spend a swift action to deliver the effects of the chosen bloodline power to that opponent. Doing so provokes no attacks of opportunity.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":581,"Name":"Spinning Throw","Description":"You whirl your foe around and then let go.","Benefit":"On a successful unarmed trip combat maneuver against an opponent your size or smaller, you can spend a swift action to attempt a bull rush combat maneuver against that opponent. If your bull rush succeeds, you can move that opponent to any unoccupied square you threaten, then push that opponent the number of 5-foot increments your successful bull rush allows. The target is then knocked prone. If the bull rush fails, you can use the Ki Throw feat as normal. If you also have the Improved Ki Throw feat, a successful bull rush allows you to push the opponent into a space secondary targets occupy. You resolve this effect as if you used the Improved Ki Throw feat to throw the opponent into that space.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":81},{"RequirementType":6,"Value":97},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":275}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":583,"Name":"Stage Combatant","Description":"You are a master of stage and nonlethal combats.","Benefit":"When you make an attack with a weapon that you have Weapon Focus in, you take no penalty on the attack roll when you are attempting to make an attack that deals no damage or nonlethal damage.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":588,"Name":"Stunning Pin","Description":"You can render a pinned foe temporarily incapacitated.","Benefit":"Whenever you pin an opponent, you can spend a swift action to make a Stunning Fist attempt against that opponent.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":158}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":590,"Name":"Sword and Pistol","Description":"You effortlessly pair melee and ranged weaponry.","Benefit":"When you use the Two-Weapon Fighting feat while wielding a melee weapon and a crossbow or firearm, your attacks with the crossbow or firearm provoke no attacks of opportunity from foes that you threaten with your melee weapon.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":128},{"RequirementType":6,"Value":574},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":591,"Name":"Tandem Trip","Description":"You know how to work together to trip your foes.","Benefit":"Whenever you attempt a trip combat maneuver against an enemy threatened by an ally with this feat, you roll twice and take the better result.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":592,"Name":"Target of Opportunity","Description":"You and your allies pelt your enemies with a deadly barrage of missiles.","Benefit":"When an ally who also has this feat makes a ranged attack and hits an opponent within 30 feet of you, you can spend an immediate action to make a single ranged attack against that opponent. Your ranged weapon must be in hand, loaded, and ready to be fired or thrown for you to make the ranged attack.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":122}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":594,"Name":"Tiger Claws","Description":"You can sacrifice multiple attacks to make a single devastating strike.","Benefit":"While you are using the Tiger Style feat and have both hands free, you can use a full-round action to make a single unarmed strike with both hands. Use your highest base attack bonus, rolling unarmed strike damage for each hand separately and multiplying both if you score a critical hit. If you use Power Attack in conjunction with this attack, can add half your Strength bonus to one of the damage rolls. If you hit, you can attempt a bull rush maneuver with a +2 bonus on the combat maneuver check. This bull rush attempt provokes no attack of opportunity from your opponent, but you cannot move with that opponent if your bull rush is successful.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":596}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":595,"Name":"Tiger Pounce","Description":"Your unarmed strikes are as precise as they are powerful, but they leave you open and you can pursue foes with blinding speed.","Benefit":"While using the Tiger Style feat, you can apply the penalty from Power Attack to your AC instead of attack rolls. Additionally, once per round as a swift action, you can move up to half your speed closer to a target you hit with an unarmed strike or made a successful combat maneuver against on this turn or your last turn.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":99},{"RequirementType":6,"Value":123},{"RequirementType":6,"Value":594},{"RequirementType":6,"Value":596}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":596,"Name":"Tiger Style","Description":"Your unarmed fighting style emulates the strength and ferocity of a tiger.","Benefit":"While using this style, you gain a +2 bonus to your CMD against bull rush, overrun, and trip maneuvers. You can also deal slashing damage with your unarmed strikes. Whenever you score a critical hit with your slashing unarmed strike, your opponent also takes 1d4 points of bleed damage at the start of his next two turns.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":3},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":601,"Name":"Two-Handed Thrower","Description":"You hurl weapons with both hands and with great force, sometimes using a whirling technique to send your weapon flying through the air at tremendous speeds.","Benefit":"Whenever you use two hands to throw a onehanded or two-handed weapon, you gain a bonus on damage rolls equal to 1-1/2 times your Strength bonus. Using two hands to throw any weapon requires only a standard action for you. If you also have the Quick Draw feat, you can throw two-handed weapons at your full normal rate of attacks.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":15}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":602,"Name":"Two-Weapon Feint","Description":"You use one weapon to distract your enemy while slipping another past his defenses.","Benefit":"While using Two-Weapon Fighting to make melee attacks, you can forgo your first primary-hand melee attack to make a Bluff check to feint an opponent.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15},{"RequirementType":3,"Value":13},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":603,"Name":"Vicious Stomp","Description":"You take advantage of the moment to brutally kick an enemy when he is down.","Benefit":"Whenever an opponent falls prone adjacent to you, that opponent provokes an attack of opportunity from you. This attack must be an unarmed strike.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":717,"Name":"Cleave Through","Description":"You are ferocious at hewing smaller opponents.","Benefit":"When using Cleave or Great Cleave, if your initial attack hits, you may take a single 5-foot step as a free action before making your additional attacks. If doing so places a creature within your threatened area, that creature becomes a legal target for your additional Cleave attack(s) as long as it meets all the other prerequisites.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":718,"Name":"Cloven Helm","Description":"Your helm turns aside lethal blows.","Benefit":"When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls; this benefit stacks with Dented Helm. When you use Dented Helm to def lect a critical hit, you may apply all damage from the critical hit to your helmet before applying any damage to yourself. If you take no damage, any additional effects, such as critical feats or poison, are negated.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":719},{"RequirementType":6,"Value":722}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":719,"Name":"Dented Helm","Description":"Your helm protects you from hard hits.","Benefit":"When wearing a helmet, you add +1 to your AC against critical hit confirmation rolls. When a critical hit is confirmed against you, as an immediate action, you can apply half of the damage from the attack to your helmet rather than yourself, applying hardness as normal. If the damage destroys your helmet, any leftover damage is applied to you. After using this feat, you are staggered until the end of your next turn. You may not use this feat if your helmet has the broken condition or the attack ignores armor bonuses to AC.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":722}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":720,"Name":"Giant Killer","Description":"Your cleaving strokes menace giants and larger foes.","Benefit":"This functions as Goblin Cleaver, but your additional attacks can be made against creatures one size category larger than you or smaller. In addition, any such attacks made against humanoids (giant) gain a +2 circumstance bonus on attack rolls.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":721},{"RequirementType":6,"Value":724},{"RequirementType":6,"Value":123},{"RequirementType":6,"Value":156}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":721,"Name":"Goblin Cleaver","Description":"You are ferocious at hewing smaller opponents.","Benefit":"When using Cleave or Great Cleave, if your initial attack hits, you may take your additional attacks against any creature smaller than you that you threaten; your targets need not be adjacent to one another. Additional attacks you make against humanoids (goblinoid) gain a +2 circumstance bonus on attack rolls.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":722,"Name":"Hard-Headed","Description":"Your thick skull is almost a weapon unto itself.","Benefit":"You gain a +1 bonus on attack rolls and combat maneuver checks made using a helmet. You receive a +2 bonus on saves against spells and special abilities that cause you to become staggered or stunned.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":724,"Name":"Orc Hewer","Description":"You are ferocious at hewing your enemies, especially orcs.","Benefit":"This feat functions as Goblin Cleaver, but your additional attacks can be made against creatures your size or smaller. In addition, any such attacks that you make against humanoids (orc) gain a +2 circumstance bonus on attack rolls.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":721},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":725,"Name":"Shatterspell","Description":"Your mighty blows shatter your enemy's magic.","Benefit":"As a standard action, you can attempt to sunder an ongoing spell effect as if you had the spell sunder rage power (Ultimate Combat 28). You may use this feat once per day, plus one additional time per day for every 5 points by which your base attack bonus exceeds +10.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":10},{"RequirementType":6,"Value":42},{"RequirementType":6,"Value":148}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":728,"Name":"Elven Battle Training","Description":"You have been specially trained to wield a variety of traditional elven weapons.","Benefit":"You have received special training with traditional elven weapons (longbows, composite longbows, longswords, rapiers, shortbows, composite shortbows, and any weapon with the word \"elven\" in its name). You receive a +2 bonus to your CMD against disarm and sunder maneuvers directed at one of these weapons you are wielding. In addition, if you are wielding one of these melee weapons, you may make an additional attack of opportunity each round (this bonus stacks with Combat Reflexes).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":756,"Name":"Surprise Follow-Through","Description":"When striking one opponent, you catch its ally off guard.","Benefit":"When using Cleave or Great Cleave, the second foe you attack on your turn is denied its Dexterity bonus against you.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":21},{"RequirementType":6,"Value":123}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":761,"Name":"Blundering Defense","Description":"Your feverish and sometimes comical defensive techniques offer enough distraction to aid allies.","Benefit":"Whenever you fight defensively or use the total defense action, allies gain a luck bonus to AC and CMD equal to 1/2 the dodge bonus you gain from the action you are taking. Allies only gain this bonus while they are adjacent to you.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":762}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":762,"Name":"Cautious Fighter","Description":"You care more about survival than victory.","Benefit":"When fighting defensively or using total defense, your dodge bonus to AC increases by 2.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":764,"Name":"Desperate Swing","Description":"You land your most telling blows in desperate situations.","Benefit":"Once per day, you can make a single melee attack while taking the total defense action. You take a -4 penalty on attack rolls when making this attack. You also gain a +4 bonus on critical confirmation rolls made while fighting defensively or making an attack of opportunity using this feat.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":762}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":769,"Name":"Risky Striker","Description":"You can make yourself a little more vulnerable to larger creatures in order to land a devastating blow.","Benefit":"You can choose to take a -1 penalty to AC to gain a +2 bonus on melee damage rolls against creatures two or more size categories larger than you. When your base attack bonus reaches +4 and every four levels thereafter, the damage increases by 2. The bonus damage is multiplied in the case of a critical hit. You can only choose to use this feat when you declare that you are making an attack action or a full-attack action with a melee weapon. The effects last until your next turn.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":771,"Name":"Surprise Strike","Description":"You actually seem to do more damage when frantically trying to avoid your enemies.","Benefit":"Once per day, when fighting defensively or making an attack of opportunity while taking the total defense action with the Desperate Swing feat, you take no penalty on the attack roll.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":762},{"RequirementType":6,"Value":764}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":772,"Name":"Uncanny Defense","Description":"Your instinct for self-preservation gives you many advantages.","Benefit":"While fighting defensively or taking the total defense action, you gain a bonus on your Ref lex saving throws and to your CMD equal to 1/2 of the dodge bonus to AC you gained from taking that action.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":3},{"RequirementType":6,"Value":762}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":774,"Name":"Critical Versatility","Description":"An open mind and combat training grant versatility to your critical hits.","Benefit":"Once per day, you can spend 1 hour practicing maneuvers to gain one single critical feat that you meet the prerequisites for. You gain the benefits of the chosen critical feat until you choose to practice a different critical feat.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":11}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":785,"Name":"Martial Mastery","Description":"You broaden your study of weapons to encompass multiple similar weapons.","Benefit":"Each combat feat you have that applies to a specific weapon (e.g., Weapon Focus) can be used with all weapons in the same weapon group (Ultimate Combat 45).","FeatType":1,"Requirements":[{"RequirementType":9,"Value":16},{"RequirementType":6,"Value":786}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":786,"Name":"Martial Versatility","Description":"You further broaden your study of weapons to encompass multiple similar weapons.","Benefit":"Choose one combat feat you know that applies to a specific weapon (e.g., Weapon Focus). You can use that feat with any weapon within the same weapon group.","FeatType":1,"Requirements":[{"RequirementType":9,"Value":4}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":830,"Name":"Fire Hand","Description":"Born with a torch in your hand, you have a gift with anything that burns.","Benefit":"You can wield a torch as a weapon without taking the nonproficient penalty and gain a +1 bonus on attack rolls with melee weapons that deal fire damage.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":833,"Name":"Goblin Gunslinger","Description":"You have learned how to fire the big guns.","Benefit":"You can wield Medium firearms without taking the penalty for an inappropriately sized weapon.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":853,"Name":"Tail Terror","Description":"You have strengthened your tail enough to make slap attacks with it.","Benefit":"You can make a tail slap attack with your tail. This is a secondary natural attack that deals 1d4 points of bludgeoning damage. Furthermore, you can augment your tail slap attack with a kobold tail attachment. For the purpose of weapon feats, you are considered proficient with all kobold tail attachments.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":858,"Name":"Grudge Fighter","Description":"You feel great anger at anyone who dares to attack you, and this fury makes your own attacks that much stronger.","Benefit":"You gain a +1 morale bonus on attack and damage rolls made against any creature that attacked you in the current combat.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":859,"Name":"Orc Weapon Expertise","Description":"You can do more with the weapons orcs favor the most.","Benefit":"When you take this feat, choose one of the benefits below. Whenever you wield a weapon that has \"orc\" in its name, you gain the benefit you chose so long as you are actually proficient with that weapon. Bully: Gain a +1 bonus on damage rolls against creatures at least one size smaller than you. Defender: Gain a +1 shield bonus to your AC (or +2 if wielding a two-handed weapon). Disrupter: Add +3 to opponents' concentration checks to cast a spell within your threatened area. This only applies if you are aware of the enemy's location and are capable of taking an attack of opportunity. If you have already used all of your available attacks of opportunity for the round, this increase does not apply. Killer: Gain a +2 competence bonus on attack rolls made to confirm critical hits. Thug: Deal +1 point of nonlethal damage with the weapon. Trickster: Gain a +2 bonus on a single type of combat maneuver check that you can perform with that weapon. This feat has no effect if you are not proficient with the weapon you're using.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":861,"Name":"Reverse-Feint","Description":"You can goad an opponent into attacking you in order to make your counter attack all the more powerful.","Benefit":"As a move action, you can leave a gap in your defenses for one adjacent opponent to use. If the opponent attacks you on its next turn, it gains a +4 bonus on its attack roll. Whether or not the opponent successfully hits, you may attack it as an immediate action with a single melee attack, gaining a +2 bonus on your attack roll.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":161}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":916,"Name":"Belier's Bite","Description":"Your unarmed strikes cause your opponent to bleed.","Benefit":"When you damage an opponent with an unarmed strike, you deal an extra 1d4 bleed damage.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":919,"Name":"Cornugon Stun","Description":"You are able to make stunning attacks with special monk weapons.","Benefit":"You may use Stunning Fist when making melee attacks with special monk weapons as well as when making unarmed attacks.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":158}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":921,"Name":"Fury's Fall","Description":"You can use strength and agility to send foes crashing to the ground.","Benefit":"When making a trip attack, add your Dexterity bonus to your CMB.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":922,"Name":"Fury's Snare","Description":"You entangle your foe in your weapon.","Benefit":"If you successfully use a whip to trip a foe, you can choose to drop your whip. Your tripped target gains the entangled condition. The target can break free of the whip by making a DC 10 Strength check or a DC 15 Escape Artist check (add the enhancement bonus of the whip to these DCs), or by using a full-round action to disentangle himself. Escaping the whip by making a Strength check means the whip gains the broken condition. If the whip has a magical quality such as flaming, apply this quality's damage to the target every round on your turn.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":921},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":923,"Name":"Hamatula Grasp","Description":"You deal terrible damage to impaled foes.","Benefit":"When attacking an impaled opponent (see Hamatula Strike) with the weapon that impales them, you only suffer a -2 penalty to your grapple check. If the check succeeds, you deal an extra 1d6 damage.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":9},{"RequirementType":6,"Value":924},{"RequirementType":6,"Value":88}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":924,"Name":"Hamatula Strike","Description":"You can catch your opponents on your weapon and hold them in place.","Benefit":"Whenever you damage an opponent with a piercing weapon, you can immediately make a grapple check; success means the opponent is impaled on your weapon and you both gain the grappled condition. While the opponent is impaled, as an attack action you may make a grapple check on your turn at a -4 penalty to damage the opponent with your weapon, even if your weapon cannot normally be used in a grapple.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":7},{"RequirementType":6,"Value":88}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":931,"Name":"Sliding Axe Throw","Description":"You may aim your thrown axe to avoid an enemy's shield and even trip your opponent.","Benefit":"You can choose to take a -2 penalty on a ranged attack roll with an axe, bouncing it or sliding it along the ground. If the target is flat-footed, running, or charging, this attack ignores any bonuses to the target's AC from its shield. If the attack hits, you may immediately make a trip attempt against the target as a free action. If you fail to trip your opponent, your opponent does not get an attempt to trip you in return. This ability may not work in certain circumstances as determined by the GM, such as if the ground is soft, there is an obstacle or difficult terrain on the floor between you and your target, and so on.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":932,"Name":"Stance of the Xorn","Description":"You have heightened awareness of enemies on all sides.","Benefit":"Flanking creatures do not gain a +2 bonus to attack you (this does not prevent you from being sneak attacked or denied your Dexterity bonus). A condition that makes you lose your Dex bonus to AC also makes you lose the benefits of this feat.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":15},{"RequirementType":10,"Value":3}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":943,"Name":"Elephant Stomp","Description":"You deliver a crushing blow to downed enemies.","Benefit":"When you overrun an opponent and your maneuver check exceeds your opponent's CMD by 5 or more, instead of moving through your opponent's space and knocking her prone, you may stop in the space directly in front of the opponent (or the nearest adjacent space) and make one attack with an unarmed strike or a natural weapon against that opponent as an immediate action.","FeatType":1,"Requirements":[{"RequirementType":0,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":123},{"RequirementType":6,"Value":93}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":944,"Name":"Jaguar Pounce","Description":"Your ambushes are especially lethal.","Benefit":"When making a charge or using Spring Attack against an opponent who is flat-footed or helpless, you treat your first melee attack against that target as if you had the Improved Critical feat.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":4}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":946,"Name":"Piranha Strike","Description":"You make a combination of quick strikes, sacrificing accuracy for multiple, minor wounds that prove exceptionally deadly.","Benefit":"When wielding a light weapon, you can choose to take a -1 penalty on all melee attack rolls and combat maneuver checks to gain a +2 bonus on all melee damage rolls. This bonus to damage is halved (-50%) if you are making an attack with an off-hand weapon or secondary natural weapon. When your base attack bonus reaches +4, and for every 4 points thereafter, the penalty increases by -1 and the bonus on damage rolls increases by +2. You must choose to use this feat before the attack roll, and its effects last until your next turn. The bonus damage does not apply to touch attacks or effects that do not deal hit point damage. This feat cannot be used in conjunction with the Power Attack feat.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":170}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":947,"Name":"Rhino Charge","Description":"Your charges are both violent and unpredictable.","Benefit":"You may ready a charge, though you may only move up to your speed on the charge.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":123},{"RequirementType":6,"Value":81}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":961,"Name":"Archon Diversion","Description":"You are able to throw yourself in front of danger to protect your friends.","Benefit":"The penalty to AC for using Archon Style to grant nearby allies a bonus to AC against a single opponent decreases to -1, and you can spend a move action instead of a standard action to use this ability. Once per round while using Archon Style, when you have at least one hand free, you can divert one melee weapon attack that would have struck an adjacent ally and take the blow in your ally's stead, using your own AC to determine whether the attack hits you. Whether or not a diverted attack actually hits you, the ally you protected can make an attack of opportunity against the diverted opponent. You expend no action to divert the attack, but you must be aware of it and must not be flat-footed. You must declare that you are using this feat after your opponent has declared the target of its melee attack but before it makes its attack roll.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":963},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":962,"Name":"Archon Justice","Description":"Your righteous indignation knows no bounds, and foes that attack your companions soon learn the error of their foolish ways.","Benefit":"You no longer take a penalty to AC for using Archon Style to grant nearby allies a bonus to AC against a single opponent, and you can spend a swift action instead of a move action to use this ability. Whenever you take damage from using Archon Diversion to divert an opponent's attack toward yourself, any allies threatening your opponent can make an attack of opportunity against the diverted opponent.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":961},{"RequirementType":6,"Value":963},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":963,"Name":"Archon Style","Description":"You have trained thoroughly to protect your allies from harm, even if it means temporarily sacrificing your own safety in the process.","Benefit":"While using this style, as a standard action, you can actively protect adjacent allies from a single opponent that you are currently adjacent to. This grants any adjacent allies a +2 dodge bonus to AC against that opponent's next melee attack (as long as that attack comes before the beginning of your next turn), but causes you to take a -2 penalty to AC against that opponent until your next turn. The dodge bonus persists even if your allies move away from you, but still only applies against attacks made by the opponent that you designated upon first using this ability.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":2},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":984,"Name":"Reckless Aim","Description":"Your lack of regard for others proves a boon when you fire projectiles into melee.","Benefit":"When you shoot or throw ranged weapons at an opponent engaged in melee, you can choose to take a -1 penalty to your AC and gain a +2 competence bonus on your attack roll. However, when you roll a natural 1 on a ranged attack roll made with this bonus, you automatically hit a random adjacent creature that threatens your intended target.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":124}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":994,"Name":"Blinding Flash","Description":"You can temporarily blind your opponent by using your weapon or shield to flash sunlight into its eyes.","Benefit":"As a move action, you can expertly angle the blade of your weapon or shield to reflect light into an opponent's eyes, dazzling your foe for 1 round. This feat functions as a gaze attack, and the target must make a Fortitude save (DC 10 + 1/2 your character level + your Dex modifier) to resist the effect. This is a sight-dependent effect, and does not work on creatures that are already blinded or creatures that do not rely on sight as their primary sense. You must be wielding a weapon or shield with a polished or reflective surface in order to use this feat. You must be in an area of bright light to use this feat.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":23}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":995,"Name":"Disorienting Blow","Description":"When you successfully strike your opponent with your Stunning Fist, you leave it in a state of confusion.","Benefit":"You must choose to use this ability before making an attack roll with your Stunning Fist, and this effect replaces other effects or conditions that would be caused by Stunning Fist. If you successfully hit your opponent and it fails its Fortitude save, it becomes confused for 1 round. Additional disorienting blows to the confused target add to the duration of its confusion. This feat is otherwise subject to all of the limits and conditions of Stunning Fist.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":158}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":998,"Name":"Hold the Blade","Description":"You can take your opponent's weapon after being stabbed in the back.","Benefit":"Whenever an enemy deals damage to you with a melee weapon as part of a flanking attack or sneak attack, you can make a combat maneuver check to disarm against that opponent as an immediate action. You must have at least one hand free when you use this feat. When you use this feat, you take a -4 penalty to your AC until your next turn. You can only use this feat once per round.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":10},{"RequirementType":6,"Value":85}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1003,"Name":"Stunning Fist Adept","Description":"Your Stunning Fist strikes become even deadlier.","Benefit":"Add +1 to the saving throw DC against your Stunning Fist attacks. This bonus does not stack with feats that grant you bonuses to the DC for saving throws against your Stunning Fist attacks, such as Mantis Style (see Pathfinder RPG Ultimate Combat).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":3},{"RequirementType":6,"Value":158}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1038,"Name":"Desperate Battler","Description":"Your experiences fighting against numerous foes that have already overwhelmed your allies, friends, and family have forced you to excel at fighting on your own.","Benefit":"When no ally is within 10 feet of you and you are not receiving benefits from the aid another action, you gain a +1 morale bonus on melee attack and damage rolls.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1041,"Name":"Flagbearer","Description":"When brandishing a flag adorned with the standard of an organization you owe allegiance to, you inspire nearby members of the same allegiance.","Benefit":"As long as you hold your clan, house, or party's f lag (see page 293), members of that allegiance within 30 feet who can see the flag (including yourself ) gain a +1 morale bonus on attack rolls, weapon damage rolls, and saving throws against fear and charm effects. You must hold the flag in one hand in order to grant this bonus. If the standard is taken by the enemy or destroyed, this bonus becomes a penalty, affecting all creatures that the bonus previously affected for 1 hour (or until you reclaim the lost flag).","FeatType":1,"Requirements":[{"RequirementType":5,"Value":15}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1042,"Name":"Focused Discipline","Description":"Familiarity with the military traditions of your homeland inspires uncommon valor in you.","Benefit":"You gain a +2 bonus on all saving throws against fear effects. Whenever a fear effect targets you and fails to affect you (either because of a successful saving throw or because of immunity to fear), you gain a +2 morale bonus on attack rolls, weapon damage rolls, and CMB checks against the creature that attempted to use the fear affect on you for 1 round.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1058,"Name":"Shrewd Tactician","Description":"Your dealings with pirates, thieves, and assassins have taught you to be exceedingly careful.","Benefit":"Opponents do not gain a +2 bonus on attack rolls for flanking you, although they can still sneak attack you. You also gain a +3 bonus on Sense Motive checks made to resist a foe's Bluff checks to feint in combat.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":4},{"RequirementType":6,"Value":24}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1066,"Name":"Slaying Sprint","Description":"With swift feet and deadly intent, you finish off your target before anyone sees your blade.","Benefit":"You can move up to half your speed instead of taking a 5-foot step when taking a full-round action to perform a coup de grace. Performing a coup de grace does not provoke attacks of opportunity. You can use this feat only when wielding a light or onehanded weapon.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":13},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114},{"RequirementType":6,"Value":150}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1067,"Name":"Greater Serpent Lash","Description":"Your ability to disarm and pull foes off balance with your whip is impressive.","Benefit":"When you make a successful disarm or trip maneuver using the Serpent Lash feat, you can make your additional disarm or trip attempt against any target within your whip's reach. With a reposition maneuver, you can move the target creature to any point within your whip's reach.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":4},{"RequirementType":6,"Value":1068}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1069,"Name":"Circling Offense","Description":"You are skilled at approaching large foes with an ally in a way that makes it difficult for your foes to find an advantage against you or your ally.","Benefit":"You receive a +1 dodge bonus to your Armor Class against attacks of opportunity provoked by moving through a creature's reach, provided the creature is of a larger size category than you and provided at least one other ally with Circling Offense is within the creature's reach. If a creature that you're receiving this dodge bonus against attacks you and misses with the attack, it provokes attacks of opportunity from any of your allies who possess Circling Offense.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":3},{"RequirementType":6,"Value":43},{"RequirementType":6,"Value":114}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1070,"Name":"Footslasher","Description":"You are trained to strike at a large foe's feet to impede its movement and cause great pain.","Benefit":"If you damage a foe that is of a larger size category than you with a weapon that does piercing or slashing damage, you can attempt to damage the creature's feet in a way that impedes its movement. Attacking a foe in this way is a standard action-you cannot use Footslasher as part of a full-attack action. When you use Footslasher, you take a -2 penalty on your attack roll, but if you hit and deal at least 1 point of damage to the target, it is affected as if by caltrops-its speed is reduced by half. This penalty lasts for 24 hours, or until the creature is successfully treated with a DC 15 Heal check or receives at least 1 point of magical healing. Footslasher does not stack with itself-once a foe has been wounded by this attack, its speed cannot be further reduced by additional attacks (or by damage from caltrops).","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1071,"Name":"Topple Foe","Description":"You and your allies can work together to trip larger foes.","Benefit":"If you attempt to trip a foe that is larger than you, you gain a +1 bonus on your CMB check to trip the foe as long as an ally with Topple Foe is flanking the foe with you. If multiple allies with Topple Foe are flanking the foe with you, you gain an additional +2 bonus on your CMD check for each additional ally that's flanking the target. The bonuses granted by this feat stack with those granted by Improved Trip and Greater Trip. Each time you attempt to trip the same foe in consecutive rounds, the bonus granted to your trip attempt increases by +1 per ally, to a maximum bonus of +4 per flanking ally on the 4th round of consecutive trip attempts.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":97}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1073,"Name":"Drunken Brawler","Description":"You have learned how to fight effectively while drunk.","Benefit":"When you drink a tankard of ale or strong alcohol, you take a -2 penalty on Reflex saving throws, but gain a number of temporary hit points equal to your level, and gain a +2 alchemical bonus on Fortitude and Will saving throws. These bonuses lasts an hour or until the temporary hit points gained by this effect are spent, whichever occurs first. The penalties last for a full hour.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":47}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1076,"Name":"Bullseye Shot","Description":"You slow your breath, calm yourself, and hit the bullseye, just as you were trained to.","Benefit":"You can spend a move action to steady your shot. When you do, you gain a +4 bonus on the next ranged attack roll you make before the end of your turn.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":5},{"RequirementType":6,"Value":122},{"RequirementType":6,"Value":124}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1078,"Name":"Charge of the Righteous","Description":"You charge undead and fiends with confidence in your righteous cause.","Benefit":"When you charge an undead creature or an evil outsider, you do not take the -2 penalty for charging.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1095,"Name":"Halfling Slinger","Description":"You have honed your racial talent for slingcraft.","Benefit":"You gain a +1 racial bonus on attack rolls made using a sling.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1101,"Name":"Brutal Grappler","Description":"When helping an ally grapple, you can damage the target.","Benefit":"When you and an ally with this feat have grappled the same creature, you may attempt to damage the opponent on your turn (whether you were the one who first initiated the grapple or were assisting your ally in doing so). You and the ally are treated as aiding each other in the grapple (+2 bonus on your grapple combat maneuver) as long as you both decide to maintain the grapple.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1211,"Name":"Overwhelm","Description":"You can overwhelm large foes with sheer numbers.","Benefit":"You are considered to be flanking an opponent if at least one ally who also has this feat is threatening that opponent and the opponent is at least two size categories larger than the larger of you or your ally, regardless of your actual positioning.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1213,"Name":"Covering Shield","Description":"You can use your shield to protect your most vulnerable parts from area effects.","Benefit":"While using a shield of the type to which your Shield Focus feat applies, you gain a bonus on Ref lex saves against area of effect attacks equal to your shield's base bonus to armor class plus any bonuses granted by feats or class abilities. This does not transfer any enhancement bonuses on a shield to Ref lex saves.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":13},{"RequirementType":6,"Value":136},{"RequirementType":6,"Value":137}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1214,"Name":"Death Frombelow","Description":"You have been trained to fight flying creatures.","Benefit":"You gain a +2 circumstance bonus against flying opponents when you have set a weapon against a charge, or when you are allowed an attack of opportunity against the flying opponent.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1217,"Name":"Flaying Critical","Description":"Your critical hits weaken your opponents' defenses.","Benefit":"Whenever you score a critical hit, your opponent takes a -1 penalty to its natural armor bonus for the duration of the encounter. This penalty is cumulative, but cannot reduce an opponent's natural armor bonus below 0.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":31}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1218,"Name":"Porcupine Defense","Description":"You are a threat to opponents that try to overwhelm you.","Benefit":"Whenever an opponent of at least one size category larger than yourself attempts a combat maneuver attack against you, you gain a +2 bonus on any allowed attacks of opportunity. If your opponent may make such attacks without provoking attacks of opportunity, you instead gain a +2 bonus to CMD against such maneuvers.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":24}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1219,"Name":"Reach Defense","Description":"You are prof icient at avoiding polearms and long-limbed creatures.","Benefit":"You gain a +2 dodge bonus to Armor Class against attacks of opportunity from opponents that are not adjacent to you.","FeatType":1,"Requirements":[{"RequirementType":1,"Value":15}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1220,"Name":"Snoutgrip","Description":"You can hold an opponent's mouth shut.","Benefit":"As an immediate action, whenever an opponent up to one size category larger than you misses you with its bite attack, you can attempt a grapple with a -5 penalty on the check. If you succeed, you have grappled your opponent and are holding its mouth shut, preventing it from using its bite attack, breath weapon, or spells with a verbal component until it escapes your grapple. You may make this grapple attempt even if the target is out of your reach.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":12},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":24},{"RequirementType":6,"Value":88},{"RequirementType":6,"Value":99}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1221,"Name":"Wingclipper","Description":"Your attacks can prevent winged opponents from flying.","Benefit":"Whenever you confirm a critical hit against an opponent that uses wings to fly, you can forgo the extra critical damage to instead prevent it from flying for a number of rounds equal to twice the critical multiplier of your attack. Opponents that are flying at the time of the critical effect must succeed at a DC 20 Fly check to avoid taking falling damage.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":9}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1223,"Name":"Patient Strike","Description":"Your training under the Master of Swords has taught you that a well-timed strike is worth waiting for and that patience will serve you well in the long run.","Benefit":"You can choose to ready an attack as a fullround action instead of a standard action. When you do so, you gain a +2 bonus on your attack roll when your readied action triggers.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1235,"Name":"Improved Underhanded Teamwork","Description":"You and your allies have trained together long enough to know how to exploit an opponent's disadvantage to make her predicament even worse.","Benefit":"Whenever an ally who also has this feat performs the dirty trick combat maneuver against a foe that you both threaten, you may attempt a dirty trick combat maneuver against the same foe as an immediate action to inf lict a second condition. If the foe uses an action to remove the first condition, it also removes the condition imposed by your immediate action.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":261},{"RequirementType":6,"Value":1236}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1236,"Name":"Underhanded Teamwork","Description":"You and your allies know how to use coordinated maneuvers to set up an enemy with an unfair disadvantage.","Benefit":"Whenever an ally who also has this feat performs a dirty trick combat maneuver against a foe you both threaten, you can use an immediate action to increase the inf licted condition's duration by 1 round.","FeatType":1,"Requirements":[{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":261}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1251,"Name":"Combat Meditation","Description":"Quick momentary meditation allows you to gain insight in combat.","Benefit":"You can meditate as a full-round action. If you do, you gain all the benefits of your meditation feats, but they last for only 1 round per character level. Combat meditation allows you to expend the +1 insight bonus granted from the Meditation Master feat to instead roll twice when attempting an ability check, attack roll, saving throw, or skill check, taking the better of the two results. You must decide to use this ability before the initial roll is made. You may only use this alternate ability in place of bonuses granted by the Meditation Master feat. You can perform combat meditation a number of times per day equal to your Wisdom modifier.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":13},{"RequirementType":7,"Value":5},{"RequirementType":6,"Value":1252}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1254,"Name":"Perfect Awareness","Description":"You can set aside all irrelevant sensory information to understand your surroundings perfectly for a moment.","Benefit":"Once per day, you can take 20 on a Perception check as a move action.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":17},{"RequirementType":7,"Value":9},{"RequirementType":6,"Value":1251},{"RequirementType":6,"Value":1252}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1256,"Name":"Slow Time","Description":"Meditation allows you to perceive time as if it were moving more slowly.","Benefit":"Once per day, when you meditate as a full-round action using the Combat Meditation feat, you gain the effects of haste for 1 round per 2 character levels. These effects do not stack with the haste spell, the speed magic weapon special ability, or other effects granting the same result. This is an extraordinary ability.","FeatType":1,"Requirements":[{"RequirementType":4,"Value":15},{"RequirementType":7,"Value":7},{"RequirementType":6,"Value":1251},{"RequirementType":6,"Value":1252}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1261,"Name":"Coordinated Distraction","Description":"When working in tandem, you can make it difficult for foes to use their magical abilities.","Benefit":"When you and at least one ally with this feat threaten the same enemy, the enemy treats the DC to cast spells defensively as 2 higher for each threatening character with this feat. If you or your allies are incapable of taking an attack of opportunity against the target for any reason, the effects of this feat do not apply.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1262,"Name":"Punch Through","Description":"You and your allies are adept at bypassing enemy defenses.","Benefit":"As a full-round action, you may make a single attack against a target. If the attack hits and deals damage to the target, all of your allies with this feat ignore up to 5 points of damage reduction against the same target for 1 round. This feat does not apply to damage reduction without a type (such as DR 10/-).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1453,"Name":"Motivating Display","Description":"You can empower your allies through their fear of you.","Benefit":"Whenever you use Dazzling Display to demoralize foes, you can motivate your allies to better serve you. In addition to possibly demoralizing foes within 30 feet, your Intimidate check while using Dazzling Display also applies to allies within 30 feet who can see you. The DC for this effect is the same as it would be to demoralize your allies. Each ally so affected gains a +1 morale bonus on attack rolls and skill checks for the duration that it would normally be shaken.","FeatType":1,"Requirements":[{"RequirementType":5,"Value":13},{"RequirementType":6,"Value":33},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1455,"Name":"Violent Display","Description":"You never miss an opportunity to cow foes.","Benefit":"When you land a successful sneak attack or confirm a critical hit against a creature with a weapon with which you have Weapon Focus, you can use Dazzling Display as an immediate action.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":33},{"RequirementType":6,"Value":171}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1467,"Name":"Extend The Bulwark","Description":"You can bolster a trained ally's defenses by interposing your own armored body.","Benefit":"If you are wearing medium or heavy armor and are adjacent to an ally who also has this feat, as a free action, you may give your ally a circumstance bonus to her AC equal to half the armor bonus provided by your armor. This bonus lasts for 1 round. During this round, you gain no bonus to your AC from your armor.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1469,"Name":"Shield Snag","Description":"You know how to navigate your shield around weapons and can use it to keep your balance.","Benefit":"Any opponents hit by your shield bash are also targeted by a free disarm attempt, substituting your attack roll for the combat maneuver check. This disarm attempt does not provoke an attack of opportunity. You cannot use this ability during the same round as a bull rush attempt made with Shield Slam or with any other abilities that affect how your shield bash works. When using a shield, you gain a +4 bonus on Strength checks to avoid being blown away by a strong wind and on Climb checks to catch yourself on a wall or slope when falling.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6},{"RequirementType":6,"Value":95},{"RequirementType":6,"Value":137},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1470,"Name":"Equipment Trick","Description":"Choose one piece of equipment, such as boots, a cloak, rope, a shield, or a heavy blade scabbard. You understand how to use that item in combat.","Benefit":"You may use any equipment tricks relating to the item if you meet the appropriate trick requirements. If the item would normally be considered an improvised weapon, you may treat it as a normal weapon or an improvised weapon, whichever is more beneficial for you.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":1}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1479,"Name":"Horn Of The Criosphinx","Description":"You end your charge in a devastating two-handed attack.","Benefit":"Whenever you make a successful charge attack while wielding a two-handed weapon in both hands, add two times your Strength bonus to the damage roll.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":6}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1480,"Name":"Wings Of The Androsphinx","Description":"You can reshape the kinetic energy of foes' charges.","Benefit":"You gain a +2 bonus to AC against charge attacks. If a creature charges you and fails its attack roll, as an immediate action you can attempt a reposition combat maneuver (Pathfinder RPG Advanced Player's Guide 322) to reposition that foe. If you use a readied action to attack a creature charging you, you can roll to attack and then attempt to reposition that creature as a free action before it resolves its charge attack.","FeatType":1,"Requirements":[{"RequirementType":3,"Value":13},{"RequirementType":10,"Value":1},{"RequirementType":6,"Value":23},{"RequirementType":6,"Value":264}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1481,"Name":"Shield Master","Description":"Your mastery of the shield allows you to fight with it without hindrance.","Benefit":"You do not suffer any penalties on attack rolls made with a shield while you are wielding another weapon. Add your shield's enhancement bonus to attacks and damage rolls made with the shield as if it was a weapon enhancement bonus.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":95},{"RequirementType":6,"Value":137},{"RequirementType":6,"Value":138},{"RequirementType":6,"Value":166}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1482,"Name":"Betraying Blow","Description":"When you break an alliance, you make sure it's broken for good.","Benefit":"Whenever you use a melee attack to deal nonlethal damage to a creature that only you threaten, roll a Bluff check opposed by your opponent's Sense Motive check. You deal an additional amount of nonlethal damage equal to 1/2 the difference between your Bluff check and your opponent's Sense Motive check (minimum 0). If your opponent has an attitude of friendly or helpful toward you (including temporarily due to Intimidate checks, charm person, and similar effects), you instead deal an amount of extra nonlethal damage equal to the difference between your checks. Regardless, the amount of extra nonlethal damage you deal with this feat cannot exceed your Hit Dice.","FeatType":1,"Requirements":[{"RequirementType":10,"Value":8},{"RequirementType":6,"Value":1483}],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1483,"Name":"Solo Maneuvers","Description":"You fight best when you're on your own.","Benefit":"Whenever you are the only one threatening an opponent, you gain a +1 bonus on combat maneuvers against that creature and a +1 bonus to CMD against combat maneuvers made by that creature.","FeatType":1,"Requirements":[],"Modifiers":[],"CombatActions":null,"IsActive":false},{"Id":1484,"Name":"Dirty Trick Master","Description":"You are adept at stifling your enemies and can expertly make a bad situation even worse.","Benefit":"Whenever you successfully perform a dirty trick combat maneuver against an opponent who is still affected by a condition inflicted by a previous dirty trick (whether your own or another creature's), you can cause the condition to worsen. In addition to increasing the duration of the condition as normal, you cause an opponent who is dazzled to become dazed, entangled to become pinned, shaken to become frightened, and sickened to become nauseated. This worsened condition replaces the previous dirty trick condition, and lasts for the duration of the dirty trick (including any rounds remaining from the previous dirty trick condition) or until the opponent uses a standard action to remove the condition (whichever comes first).","FeatType":1,"Requirements":[{"RequirementType":10,"Value":11},{"RequirementType":6,"Value":251},{"RequirementType":6,"Value":261}],"Modifiers":[],"CombatActions":null,"IsActive":false}]